[Killed] EqualityOperator
src/pages/Dashboard/Dashboard.jsx:16:20
   const { token, user } = useAuth();
   
   // Check if user has active status
-  const isActive = user?.active !== false;
+  const isActive = user?.active === false;
   // Check if user is volunteer
   const isVolunteer = user?.role === 'volunteer';
killedBy: Dashboard - Role-Based Access Control Student/Builder Role should show standard navigation items for students
statusReason: Found multiple elements with the text: Calendar

Here are the matching elements:

Ignored nodes: comments, script, style
<span
  class="text-white text-sm font-medium whitespace-nowrap"
>

[Killed] OptionalChaining
src/pages/Dashboard/Dashboard.jsx:16:20
   const { token, user } = useAuth();
   
   // Check if user has active status
-  const isActive = user?.active !== false;
+  const isActive = user.active !== false;
   // Check if user is volunteer
   const isVolunteer = user?.role === 'volunteer';
killedBy: Dashboard - Role-Based Access Control Role Permission Edge Cases should handle null user gracefully
statusReason: Cannot read properties of null (reading 'active')

[Killed] OptionalChaining
src/pages/Dashboard/Dashboard.jsx:18:23
   // Check if user has active status
   const isActive = user?.active !== false;
   // Check if user is volunteer
-  const isVolunteer = user?.role === 'volunteer';
+  const isVolunteer = user.role === 'volunteer';
   
   const [isLoading, setIsLoading] = useState(true);
killedBy: Dashboard - Role-Based Access Control Role Permission Edge Cases should handle null user gracefully
statusReason: Cannot read properties of null (reading 'role')

[Killed] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:18:23
   // Check if user has active status
   const isActive = user?.active !== false;
   // Check if user is volunteer
-  const isVolunteer = user?.role === 'volunteer';
+  const isVolunteer = false;
   
   const [isLoading, setIsLoading] = useState(true);
killedBy: Dashboard - Role-Based Access Control Volunteer Role should show volunteer-specific dashboard view
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h1
  class="dashboard__greeting-text"
>
  Hey 
  Jane
  . Good to see you!

[Survived] BooleanLiteral
src/pages/Dashboard/Dashboard.jsx:20:46
   // Check if user is volunteer
   const isVolunteer = user?.role === 'volunteer';
   
-  const [isLoading, setIsLoading] = useState(true);
+  const [isLoading, setIsLoading] = useState(false);
   const [error, setError] = useState(null);
   const [currentDay, setCurrentDay] = useState(null);

[Survived] ArrayDeclaration
src/pages/Dashboard/Dashboard.jsx:23:48
   const [isLoading, setIsLoading] = useState(true);
   const [error, setError] = useState(null);
   const [currentDay, setCurrentDay] = useState(null);
-  const [dailyTasks, setDailyTasks] = useState([]);
+  const [dailyTasks, setDailyTasks] = useState(["Stryker was here"]);
   const [objectives, setObjectives] = useState([]);
   const [cohortFilter, setCohortFilter] = useState(null);

[Survived] ArrayDeclaration
src/pages/Dashboard/Dashboard.jsx:24:48
   const [error, setError] = useState(null);
   const [currentDay, setCurrentDay] = useState(null);
   const [dailyTasks, setDailyTasks] = useState([]);
-  const [objectives, setObjectives] = useState([]);
+  const [objectives, setObjectives] = useState(["Stryker was here"]);
   const [cohortFilter, setCohortFilter] = useState(null);
   const [missedAssignmentsCount, setMissedAssignmentsCount] = useState(0);

[Survived] BooleanLiteral
src/pages/Dashboard/Dashboard.jsx:31:54
   const [currentWeek, setCurrentWeek] = useState(null);
   const [currentLevel, setCurrentLevel] = useState(null);
   const [weeklyGoal, setWeeklyGoal] = useState('');
-  const [isLoadingWeek, setIsLoadingWeek] = useState(false);
+  const [isLoadingWeek, setIsLoadingWeek] = useState(true);
   const [slideDirection, setSlideDirection] = useState(null); // 'left' or 'right'
   const [isSidebarOpen, setIsSidebarOpen] = useState(false);

[Killed] BooleanLiteral
src/pages/Dashboard/Dashboard.jsx:33:54
   const [weeklyGoal, setWeeklyGoal] = useState('');
   const [isLoadingWeek, setIsLoadingWeek] = useState(false);
   const [slideDirection, setSlideDirection] = useState(null); // 'left' or 'right'
-  const [isSidebarOpen, setIsSidebarOpen] = useState(false);
+  const [isSidebarOpen, setIsSidebarOpen] = useState(true);
   const [weekCache, setWeekCache] = useState({}); // Cache all weeks data
 
killedBy: Dashboard - Role-Based Access Control Inactive User Access should still show navigation for inactive users
statusReason: Unable to find an accessible element with the role "link" and name `/Dashboard/i`

Here are the accessible roles:

  dialog:

  Name "":
  <div

[Killed] BlockStatement
src/pages/Dashboard/Dashboard.jsx:36:19
   const [isSidebarOpen, setIsSidebarOpen] = useState(false);
   const [weekCache, setWeekCache] = useState({}); // Cache all weeks data
 
-  useEffect(() => {
-    // Only fetch dashboard data if user is active
-    if (isActive) {
-      fetchDashboardData();
-    } else {
-      // If user is inactive, we don't need to load the dashboard data
-      setIsLoading(false);
-    }
-  }, [token, cohortFilter, user?.role, isActive]);
+  useEffect(() => {}, [token, cohortFilter, user?.role, isActive]);
 
   const fetchDashboardData = async () => {
killedBy: Dashboard - Role-Based Access Control Student/Builder Role should render dashboard content for active students
statusReason: Unable to find an element with the text: /Hey John. Good to see you!/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex items-center justify-center min-h-screen"
    >

[Killed] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:38:9
 
   useEffect(() => {
     // Only fetch dashboard data if user is active
-    if (isActive) {
+    if (false) {
       fetchDashboardData();
     } else {
killedBy: Dashboard - Role-Based Access Control Student/Builder Role should render dashboard content for active students
statusReason: Unable to find an element with the text: /Learn Testing/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="dashboard"
    >

[Killed] BlockStatement
src/pages/Dashboard/Dashboard.jsx:38:19
 
   useEffect(() => {
     // Only fetch dashboard data if user is active
-    if (isActive) {
-      fetchDashboardData();
-    } else {
+    if (isActive) {} else {
       // If user is inactive, we don't need to load the dashboard data
       setIsLoading(false);
killedBy: Dashboard - Role-Based Access Control Student/Builder Role should render dashboard content for active students
statusReason: Unable to find an element with the text: /Hey John. Good to see you!/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex items-center justify-center min-h-screen"
    >

[Survived] BlockStatement
src/pages/Dashboard/Dashboard.jsx:40:12
     // Only fetch dashboard data if user is active
     if (isActive) {
       fetchDashboardData();
-    } else {
-      // If user is inactive, we don't need to load the dashboard data
-      setIsLoading(false);
-    }
+    } else {}
   }, [token, cohortFilter, user?.role, isActive]);
 

[Survived] BooleanLiteral
src/pages/Dashboard/Dashboard.jsx:42:20
       fetchDashboardData();
     } else {
       // If user is inactive, we don't need to load the dashboard data
-      setIsLoading(false);
+      setIsLoading(true);
     }
   }, [token, cohortFilter, user?.role, isActive]);

[Killed] OptionalChaining
src/pages/Dashboard/Dashboard.jsx:44:28
       // If user is inactive, we don't need to load the dashboard data
       setIsLoading(false);
     }
-  }, [token, cohortFilter, user?.role, isActive]);
+  }, [token, cohortFilter, user.role, isActive]);
 
   const fetchDashboardData = async () => {
killedBy: Dashboard - Role-Based Access Control Role Permission Edge Cases should handle null user gracefully
statusReason: Cannot read properties of null (reading 'role')

[Survived] StringLiteral
src/pages/Dashboard/Dashboard.jsx:51:17
       setIsLoading(true);
       setError(null);
       
-      let url = `${import.meta.env.VITE_API_URL}/api/progress/current-day`;
+      let url = ``;
       
       // Add cohort parameter for staff/admin if selected

[Survived] EqualityOperator
src/pages/Dashboard/Dashboard.jsx:54:38
       let url = `${import.meta.env.VITE_API_URL}/api/progress/current-day`;
       
       // Add cohort parameter for staff/admin if selected
-      if ((user?.role === 'staff' || user?.role === 'admin') && cohortFilter) {
+      if ((user?.role === 'staff' || user?.role !== 'admin') && cohortFilter) {
         url += `?cohort=${encodeURIComponent(cohortFilter)}`;
       }

[Survived] LogicalOperator
src/pages/Dashboard/Dashboard.jsx:54:11
       let url = `${import.meta.env.VITE_API_URL}/api/progress/current-day`;
       
       // Add cohort parameter for staff/admin if selected
-      if ((user?.role === 'staff' || user?.role === 'admin') && cohortFilter) {
+      if (user?.role === 'staff' || user?.role === 'admin' || cohortFilter) {
         url += `?cohort=${encodeURIComponent(cohortFilter)}`;
       }

[NoCoverage] StringLiteral
src/pages/Dashboard/Dashboard.jsx:55:16
       
       // Add cohort parameter for staff/admin if selected
       if ((user?.role === 'staff' || user?.role === 'admin') && cohortFilter) {
-        url += `?cohort=${encodeURIComponent(cohortFilter)}`;
+        url += ``;
       }
       

[NoCoverage] ArrowFunction
src/pages/Dashboard/Dashboard.jsx:65:55
       });
       
       if (!response.ok) {
-        const errorData = await response.json().catch(() => ({}));
+        const errorData = await response.json().catch(() => undefined);
         const error = new Error(errorData.error || 'Failed to fetch dashboard data');
         error.response = { status: response.status, data: errorData };

[NoCoverage] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:66:33
       
       if (!response.ok) {
         const errorData = await response.json().catch(() => ({}));
-        const error = new Error(errorData.error || 'Failed to fetch dashboard data');
+        const error = new Error(true);
         error.response = { status: response.status, data: errorData };
         throw error;

[NoCoverage] LogicalOperator
src/pages/Dashboard/Dashboard.jsx:66:33
       
       if (!response.ok) {
         const errorData = await response.json().catch(() => ({}));
-        const error = new Error(errorData.error || 'Failed to fetch dashboard data');
+        const error = new Error(errorData.error && 'Failed to fetch dashboard data');
         error.response = { status: response.status, data: errorData };
         throw error;

[Killed] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:73:11
       
       const data = await response.json();
       
-      if (data.message === 'No schedule for today') {
+      if (true) {
         setIsLoading(false);
         return;
killedBy: Dashboard - Role-Based Access Control Student/Builder Role should render dashboard content for active students
statusReason: Unable to find an element with the text: /Learn Testing/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="dashboard"
    >

[Killed] EqualityOperator
src/pages/Dashboard/Dashboard.jsx:73:11
       
       const data = await response.json();
       
-      if (data.message === 'No schedule for today') {
+      if (data.message !== 'No schedule for today') {
         setIsLoading(false);
         return;
killedBy: Dashboard - Role-Based Access Control Student/Builder Role should render dashboard content for active students
statusReason: Unable to find an element with the text: /Learn Testing/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="dashboard"
    >

[NoCoverage] BooleanLiteral
src/pages/Dashboard/Dashboard.jsx:74:22
       const data = await response.json();
       
       if (data.message === 'No schedule for today') {
-        setIsLoading(false);
+        setIsLoading(true);
         return;
       }

[Killed] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:79:26
       }
       
       // Process the data
-      const timeBlocks = data.timeBlocks || [];
+      const timeBlocks = false;
       const taskProgress = Array.isArray(data.taskProgress) ? data.taskProgress : [];
       
killedBy: Dashboard - Role-Based Access Control Student/Builder Role should render dashboard content for active students
statusReason: Unable to find an element with the text: /Learn Testing/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-4 mx-6 mt-6 bg-destructive/10 border border-destructive/20 rounded-lg"
    >

[Killed] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:79:26
       }
       
       // Process the data
-      const timeBlocks = data.timeBlocks || [];
+      const timeBlocks = true;
       const taskProgress = Array.isArray(data.taskProgress) ? data.taskProgress : [];
       
killedBy: Dashboard - Role-Based Access Control Student/Builder Role should render dashboard content for active students
statusReason: Unable to find an element with the text: /Learn Testing/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="p-4 mx-6 mt-6 bg-destructive/10 border border-destructive/20 rounded-lg"
    >

[NoCoverage] BlockStatement
src/pages/Dashboard/Dashboard.jsx:85:35
       // Extract tasks from all time blocks
       const allTasks = [];
       
-      timeBlocks.forEach(block => {
-        // Add tasks with their completion status
-        block.tasks.forEach(task => {
-          const taskCompleted = taskProgress.find(
-            progress => progress.task_id === task.id
-          )?.status === 'completed';
-          
-          allTasks.push({
-            id: task.id,
-            time: formatTime(block.start_time),
-            title: task.task_title,
-            duration: `${task.duration_minutes} min`,
-            type: task.task_type,
-            completed: taskCompleted
-          });
-        });
-      });
+      timeBlocks.forEach(block => {});
       
       // Set state with the processed data

[NoCoverage] BlockStatement
src/pages/Dashboard/Dashboard.jsx:87:37
       
       timeBlocks.forEach(block => {
         // Add tasks with their completion status
-        block.tasks.forEach(task => {
-          const taskCompleted = taskProgress.find(
-            progress => progress.task_id === task.id
-          )?.status === 'completed';
-          
-          allTasks.push({
-            id: task.id,
-            time: formatTime(block.start_time),
-            title: task.task_title,
-            duration: `${task.duration_minutes} min`,
-            type: task.task_type,
-            completed: taskCompleted
-          });
-        });
+        block.tasks.forEach(task => {});
       });
       

[NoCoverage] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:88:33
       timeBlocks.forEach(block => {
         // Add tasks with their completion status
         block.tasks.forEach(task => {
-          const taskCompleted = taskProgress.find(
-            progress => progress.task_id === task.id
-          )?.status === 'completed';
+          const taskCompleted = false;
           
           allTasks.push({

[NoCoverage] EqualityOperator
src/pages/Dashboard/Dashboard.jsx:88:33
       timeBlocks.forEach(block => {
         // Add tasks with their completion status
         block.tasks.forEach(task => {
-          const taskCompleted = taskProgress.find(
-            progress => progress.task_id === task.id
-          )?.status === 'completed';
+          const taskCompleted = taskProgress.find(progress => progress.task_id === task.id)?.status !== 'completed';
           
           allTasks.push({

[NoCoverage] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:89:25
         // Add tasks with their completion status
         block.tasks.forEach(task => {
           const taskCompleted = taskProgress.find(
-            progress => progress.task_id === task.id
+            progress => true
           )?.status === 'completed';
           

[NoCoverage] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:89:25
         // Add tasks with their completion status
         block.tasks.forEach(task => {
           const taskCompleted = taskProgress.find(
-            progress => progress.task_id === task.id
+            progress => false
           )?.status === 'completed';
           

[NoCoverage] StringLiteral
src/pages/Dashboard/Dashboard.jsx:90:25
         block.tasks.forEach(task => {
           const taskCompleted = taskProgress.find(
             progress => progress.task_id === task.id
-          )?.status === 'completed';
+          )?.status === "";
           
           allTasks.push({

[NoCoverage] ObjectLiteral
src/pages/Dashboard/Dashboard.jsx:92:25
             progress => progress.task_id === task.id
           )?.status === 'completed';
           
-          allTasks.push({
-            id: task.id,
-            time: formatTime(block.start_time),
-            title: task.task_title,
-            duration: `${task.duration_minutes} min`,
-            type: task.task_type,
-            completed: taskCompleted
-          });
+          allTasks.push({});
         });
       });

[Killed] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:104:21
       });
       
       // Set state with the processed data
-      setCurrentDay(data.day || {});
+      setCurrentDay(false);
       setDailyTasks(allTasks);
       
killedBy: Dashboard - Role-Based Access Control Student/Builder Role should render dashboard content for active students
statusReason: Unable to find an element with the text: /Learn Testing/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="dashboard"
    >

[Killed] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:104:21
       });
       
       // Set state with the processed data
-      setCurrentDay(data.day || {});
+      setCurrentDay(true);
       setDailyTasks(allTasks);
       
killedBy: Dashboard - Role-Based Access Control Student/Builder Role should render dashboard content for active students
statusReason: Unable to find an element with the text: /Learn Testing/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="dashboard"
    >

[Survived] LogicalOperator
src/pages/Dashboard/Dashboard.jsx:108:29
       setDailyTasks(allTasks);
       
       // Get learning objectives from the day object
-      const dayObjectives = data.day && data.day.learning_objectives ? 
+      const dayObjectives = data.day || data.day.learning_objectives ? 
         data.day.learning_objectives : [];
       setObjectives(dayObjectives);

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:108:29
       setDailyTasks(allTasks);
       
       // Get learning objectives from the day object
-      const dayObjectives = data.day && data.day.learning_objectives ? 
+      const dayObjectives = true ? 
         data.day.learning_objectives : [];
       setObjectives(dayObjectives);

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:113:33
       setObjectives(dayObjectives);
       
       // Set missed assignments count
-      setMissedAssignmentsCount(data.missedAssignmentsCount || 0);
+      setMissedAssignmentsCount(true);
       
       // Set level, week, and weekly goal

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:113:33
       setObjectives(dayObjectives);
       
       // Set missed assignments count
-      setMissedAssignmentsCount(data.missedAssignmentsCount || 0);
+      setMissedAssignmentsCount(false);
       
       // Set level, week, and weekly goal

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:116:11
       setMissedAssignmentsCount(data.missedAssignmentsCount || 0);
       
       // Set level, week, and weekly goal
-      if (data.day) {
+      if (true) {
         setCurrentLevel(data.day.level || 1);
         setCurrentWeek(data.day.week);

[Survived] BlockStatement
src/pages/Dashboard/Dashboard.jsx:116:21
       setMissedAssignmentsCount(data.missedAssignmentsCount || 0);
       
       // Set level, week, and weekly goal
-      if (data.day) {
-        setCurrentLevel(data.day.level || 1);
-        setCurrentWeek(data.day.week);
-        setWeeklyGoal(data.day.weekly_goal || '');
-        
-        // Preload all weeks and fetch current week data
-        if (data.day.week) {
-          // Preload all weeks in parallel (don't await)
-          preloadAllWeeks(data.day.week);
-          
-          // Fetch current week data
-          await fetchWeekData(data.day.week);
-        }
-      }
+      if (data.day) {}
       
     } catch (error) {

[Survived] LogicalOperator
src/pages/Dashboard/Dashboard.jsx:117:25
       
       // Set level, week, and weekly goal
       if (data.day) {
-        setCurrentLevel(data.day.level || 1);
+        setCurrentLevel(data.day.level && 1);
         setCurrentWeek(data.day.week);
         setWeeklyGoal(data.day.weekly_goal || '');

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:117:25
       
       // Set level, week, and weekly goal
       if (data.day) {
-        setCurrentLevel(data.day.level || 1);
+        setCurrentLevel(true);
         setCurrentWeek(data.day.week);
         setWeeklyGoal(data.day.weekly_goal || '');

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:119:23
       if (data.day) {
         setCurrentLevel(data.day.level || 1);
         setCurrentWeek(data.day.week);
-        setWeeklyGoal(data.day.weekly_goal || '');
+        setWeeklyGoal(false);
         
         // Preload all weeks and fetch current week data

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:119:23
       if (data.day) {
         setCurrentLevel(data.day.level || 1);
         setCurrentWeek(data.day.week);
-        setWeeklyGoal(data.day.weekly_goal || '');
+        setWeeklyGoal(true);
         
         // Preload all weeks and fetch current week data

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:122:13
         setWeeklyGoal(data.day.weekly_goal || '');
         
         // Preload all weeks and fetch current week data
-        if (data.day.week) {
+        if (false) {
           // Preload all weeks in parallel (don't await)
           preloadAllWeeks(data.day.week);

[Survived] BlockStatement
src/pages/Dashboard/Dashboard.jsx:122:28
         setWeeklyGoal(data.day.weekly_goal || '');
         
         // Preload all weeks and fetch current week data
-        if (data.day.week) {
-          // Preload all weeks in parallel (don't await)
-          preloadAllWeeks(data.day.week);
-          
-          // Fetch current week data
-          await fetchWeekData(data.day.week);
-        }
+        if (data.day.week) {}
       }
       

[Survived] BlockStatement
src/pages/Dashboard/Dashboard.jsx:131:21
         }
       }
       
-    } catch (error) {
-      console.error('Error fetching dashboard data:', error);
-      setError('Failed to load dashboard data. Please try again later.');
-    } finally {
+    } catch (error) {} finally {
       setIsLoading(false);
     }

[Survived] StringLiteral
src/pages/Dashboard/Dashboard.jsx:132:21
       }
       
     } catch (error) {
-      console.error('Error fetching dashboard data:', error);
+      console.error("", error);
       setError('Failed to load dashboard data. Please try again later.');
     } finally {

[Killed] BlockStatement
src/pages/Dashboard/Dashboard.jsx:134:15
     } catch (error) {
       console.error('Error fetching dashboard data:', error);
       setError('Failed to load dashboard data. Please try again later.');
-    } finally {
-      setIsLoading(false);
-    }
+    } finally {}
   };
 
killedBy: Dashboard - Role-Based Access Control Student/Builder Role should render dashboard content for active students
statusReason: Unable to find an element with the text: /Hey John. Good to see you!/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex items-center justify-center min-h-screen"
    >

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:142:28
   // Preload all weeks data on initial load
   const preloadAllWeeks = async (currentWeekNum) => {
     try {
-      const cohortParam = (user?.role === 'staff' || user?.role === 'admin') && cohortFilter
+      const cohortParam = (false || user?.role === 'admin') && cohortFilter
         ? `?cohort=${encodeURIComponent(cohortFilter)}`
         : '';

[Survived] OptionalChaining
src/pages/Dashboard/Dashboard.jsx:142:54
   // Preload all weeks data on initial load
   const preloadAllWeeks = async (currentWeekNum) => {
     try {
-      const cohortParam = (user?.role === 'staff' || user?.role === 'admin') && cohortFilter
+      const cohortParam = (user?.role === 'staff' || user.role === 'admin') && cohortFilter
         ? `?cohort=${encodeURIComponent(cohortFilter)}`
         : '';

[NoCoverage] StringLiteral
src/pages/Dashboard/Dashboard.jsx:143:11
   const preloadAllWeeks = async (currentWeekNum) => {
     try {
       const cohortParam = (user?.role === 'staff' || user?.role === 'admin') && cohortFilter
-        ? `?cohort=${encodeURIComponent(cohortFilter)}`
+        ? ``
         : '';
       

[Survived] ArrayDeclaration
src/pages/Dashboard/Dashboard.jsx:147:28
         : '';
       
       // Fetch weeks 1 through current week
-      const weekPromises = [];
+      const weekPromises = ["Stryker was here"];
       for (let week = 1; week <= currentWeekNum; week++) {
         weekPromises.push(

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:148:26
       
       // Fetch weeks 1 through current week
       const weekPromises = [];
-      for (let week = 1; week <= currentWeekNum; week++) {
+      for (let week = 1; false; week++) {
         weekPromises.push(
           fetch(

[Survived] EqualityOperator
src/pages/Dashboard/Dashboard.jsx:148:26
       
       // Fetch weeks 1 through current week
       const weekPromises = [];
-      for (let week = 1; week <= currentWeekNum; week++) {
+      for (let week = 1; week > currentWeekNum; week++) {
         weekPromises.push(
           fetch(

[Survived] ObjectLiteral
src/pages/Dashboard/Dashboard.jsx:152:13
         weekPromises.push(
           fetch(
             `${import.meta.env.VITE_API_URL}/api/curriculum/weeks/${week}${cohortParam}`,
-            {
-              headers: {
-                'Authorization': `Bearer ${token}`
-              }
-            }
+            {}
           ).then(res => res.ok ? res.json() : null)
         );

[Survived] ArrowFunction
src/pages/Dashboard/Dashboard.jsx:157:18
                 'Authorization': `Bearer ${token}`
               }
             }
-          ).then(res => res.ok ? res.json() : null)
+          ).then(() => undefined)
         );
       }

[Survived] BlockStatement
src/pages/Dashboard/Dashboard.jsx:165:45
       
       // Build cache object
       const cache = {};
-      allWeeksData.forEach((days, index) => {
-        if (days) {
-          cache[index + 1] = days; // week number is index + 1
-        }
-      });
+      allWeeksData.forEach((days, index) => {});
       
       setWeekCache(cache);

[Survived] BlockStatement
src/pages/Dashboard/Dashboard.jsx:166:19
       // Build cache object
       const cache = {};
       allWeeksData.forEach((days, index) => {
-        if (days) {
-          cache[index + 1] = days; // week number is index + 1
-        }
+        if (days) {}
       });
       

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:166:13
       // Build cache object
       const cache = {};
       allWeeksData.forEach((days, index) => {
-        if (days) {
+        if (true) {
           cache[index + 1] = days; // week number is index + 1
         }
