[Survived] BooleanLiteral
src/components/Layout/Layout.jsx:9:58
 import logo from '../../assets/logo.png';
 
 const Layout = ({ children }) => {
-  const [isNavbarHovered, setIsNavbarHovered] = useState(false);
+  const [isNavbarHovered, setIsNavbarHovered] = useState(true);
   const [isMobileNavbarOpen, setIsMobileNavbarOpen] = useState(false);
   const [isMobile, setIsMobile] = useState(false);

[Survived] BooleanLiteral
src/components/Layout/Layout.jsx:10:64
 
 const Layout = ({ children }) => {
   const [isNavbarHovered, setIsNavbarHovered] = useState(false);
-  const [isMobileNavbarOpen, setIsMobileNavbarOpen] = useState(false);
+  const [isMobileNavbarOpen, setIsMobileNavbarOpen] = useState(true);
   const [isMobile, setIsMobile] = useState(false);
   const { logout, user } = useAuth();

[Survived] BooleanLiteral
src/components/Layout/Layout.jsx:11:44
 const Layout = ({ children }) => {
   const [isNavbarHovered, setIsNavbarHovered] = useState(false);
   const [isMobileNavbarOpen, setIsMobileNavbarOpen] = useState(false);
-  const [isMobile, setIsMobile] = useState(false);
+  const [isMobile, setIsMobile] = useState(true);
   const { logout, user } = useAuth();
   const navigate = useNavigate();

[Survived] BlockStatement
src/components/Layout/Layout.jsx:17:19
   const location = useLocation();
   
   // Detect mobile vs desktop
-  useEffect(() => {
-    const checkMobile = () => {
-      setIsMobile(window.innerWidth < 768); // Mobile breakpoint
-    };
-
-    checkMobile();
-    window.addEventListener('resize', checkMobile);
-
-    return () => window.removeEventListener('resize', checkMobile);
-  }, []);
+  useEffect(() => {}, []);
 
   const handleLogout = () => {

[Survived] BlockStatement
src/components/Layout/Layout.jsx:18:31
   
   // Detect mobile vs desktop
   useEffect(() => {
-    const checkMobile = () => {
-      setIsMobile(window.innerWidth < 768); // Mobile breakpoint
-    };
+    const checkMobile = () => {};
 
     checkMobile();

[Killed] ConditionalExpression
src/components/Layout/Layout.jsx:19:19
   // Detect mobile vs desktop
   useEffect(() => {
     const checkMobile = () => {
-      setIsMobile(window.innerWidth < 768); // Mobile breakpoint
+      setIsMobile(true); // Mobile breakpoint
     };
 
killedBy: Dashboard - Role-Based Access Control Student/Builder Role should show standard navigation items for students
statusReason: Unable to find an element with the text: Dashboard. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex h-screen w-full bg-background"
    >

[Killed] EqualityOperator
src/components/Layout/Layout.jsx:19:19
   // Detect mobile vs desktop
   useEffect(() => {
     const checkMobile = () => {
-      setIsMobile(window.innerWidth < 768); // Mobile breakpoint
+      setIsMobile(window.innerWidth >= 768); // Mobile breakpoint
     };
 
killedBy: Dashboard - Role-Based Access Control Student/Builder Role should show standard navigation items for students
statusReason: Unable to find an element with the text: Dashboard. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex h-screen w-full bg-background"
    >

[Survived] ArrowFunction
src/components/Layout/Layout.jsx:25:12
     checkMobile();
     window.addEventListener('resize', checkMobile);
 
-    return () => window.removeEventListener('resize', checkMobile);
+    return () => undefined;
   }, []);
 

[NoCoverage] BlockStatement
src/components/Layout/Layout.jsx:28:30
     return () => window.removeEventListener('resize', checkMobile);
   }, []);
 
-  const handleLogout = () => {
-    logout();
-    navigate('/login');
-  };
+  const handleLogout = () => {};
   
   const toggleMobileNavbar = () => {

[NoCoverage] BlockStatement
src/components/Layout/Layout.jsx:33:36
     navigate('/login');
   };
   
-  const toggleMobileNavbar = () => {
-    setIsMobileNavbarOpen(!isMobileNavbarOpen);
-  };
+  const toggleMobileNavbar = () => {};
 
   const closeMobileNavbar = () => {

[NoCoverage] BooleanLiteral
src/components/Layout/Layout.jsx:34:27
   };
   
   const toggleMobileNavbar = () => {
-    setIsMobileNavbarOpen(!isMobileNavbarOpen);
+    setIsMobileNavbarOpen(isMobileNavbarOpen);
   };
 

[NoCoverage] BlockStatement
src/components/Layout/Layout.jsx:37:35
     setIsMobileNavbarOpen(!isMobileNavbarOpen);
   };
 
-  const closeMobileNavbar = () => {
-    setIsMobileNavbarOpen(false);
-  };
+  const closeMobileNavbar = () => {};
 
   // Get the current page icon for mobile menu button

[NoCoverage] BooleanLiteral
src/components/Layout/Layout.jsx:38:27
   };
 
   const closeMobileNavbar = () => {
-    setIsMobileNavbarOpen(false);
+    setIsMobileNavbarOpen(true);
   };
 

[NoCoverage] LogicalOperator
src/components/Layout/Layout.jsx:90:9
     };
 
     // Check for admin routes
-    if (location.pathname === '/admin-dashboard' && (user?.role === 'admin' || user?.role === 'staff')) {
+    if (location.pathname === '/admin-dashboard' || user?.role === 'admin' || user?.role === 'staff') {
       return <Settings className="h-4 w-4 text-[#E3E3E3]" />;
     }

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:90:80
     };
 
     // Check for admin routes
-    if (location.pathname === '/admin-dashboard' && (user?.role === 'admin' || user?.role === 'staff')) {
+    if (location.pathname === '/admin-dashboard' && (user?.role === 'admin' || false)) {
       return <Settings className="h-4 w-4 text-[#E3E3E3]" />;
     }

[NoCoverage] EqualityOperator
src/components/Layout/Layout.jsx:93:9
     if (location.pathname === '/admin-dashboard' && (user?.role === 'admin' || user?.role === 'staff')) {
       return <Settings className="h-4 w-4 text-[#E3E3E3]" />;
     }
-    if (location.pathname === '/admin/assessment-grades' && (user?.role === 'admin' || user?.role === 'staff')) {
+    if (location.pathname !== '/admin/assessment-grades' && (user?.role === 'admin' || user?.role === 'staff')) {
       return <Award className="h-4 w-4 text-[#E3E3E3]" />;
     }

[NoCoverage] OptionalChaining
src/components/Layout/Layout.jsx:93:88
     if (location.pathname === '/admin-dashboard' && (user?.role === 'admin' || user?.role === 'staff')) {
       return <Settings className="h-4 w-4 text-[#E3E3E3]" />;
     }
-    if (location.pathname === '/admin/assessment-grades' && (user?.role === 'admin' || user?.role === 'staff')) {
+    if (location.pathname === '/admin/assessment-grades' && (user?.role === 'admin' || user.role === 'staff')) {
       return <Award className="h-4 w-4 text-[#E3E3E3]" />;
     }

[NoCoverage] OptionalChaining
src/components/Layout/Layout.jsx:96:85
     if (location.pathname === '/admin/assessment-grades' && (user?.role === 'admin' || user?.role === 'staff')) {
       return <Award className="h-4 w-4 text-[#E3E3E3]" />;
     }
-    if (location.pathname === '/admissions-dashboard' && (user?.role === 'admin' || user?.role === 'staff')) {
+    if (location.pathname === '/admissions-dashboard' && (user?.role === 'admin' || user.role === 'staff')) {
       return <Users className="h-4 w-4 text-[#E3E3E3]" />;
     }

[NoCoverage] EqualityOperator
src/components/Layout/Layout.jsx:96:9
     if (location.pathname === '/admin/assessment-grades' && (user?.role === 'admin' || user?.role === 'staff')) {
       return <Award className="h-4 w-4 text-[#E3E3E3]" />;
     }
-    if (location.pathname === '/admissions-dashboard' && (user?.role === 'admin' || user?.role === 'staff')) {
+    if (location.pathname !== '/admissions-dashboard' && (user?.role === 'admin' || user?.role === 'staff')) {
       return <Users className="h-4 w-4 text-[#E3E3E3]" />;
     }

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:99:92
     if (location.pathname === '/admissions-dashboard' && (user?.role === 'admin' || user?.role === 'staff')) {
       return <Users className="h-4 w-4 text-[#E3E3E3]" />;
     }
-    if ((location.pathname === '/content' || location.pathname.startsWith('/content')) && (user?.role === 'admin' || user?.role === 'staff')) {
+    if ((location.pathname === '/content' || location.pathname.startsWith('/content')) && (true)) {
       return <Bug className="h-4 w-4 text-[#E3E3E3]" />;
     }

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:99:9
     if (location.pathname === '/admissions-dashboard' && (user?.role === 'admin' || user?.role === 'staff')) {
       return <Users className="h-4 w-4 text-[#E3E3E3]" />;
     }
-    if ((location.pathname === '/content' || location.pathname.startsWith('/content')) && (user?.role === 'admin' || user?.role === 'staff')) {
+    if (false) {
       return <Bug className="h-4 w-4 text-[#E3E3E3]" />;
     }

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:102:52
     if ((location.pathname === '/content' || location.pathname.startsWith('/content')) && (user?.role === 'admin' || user?.role === 'staff')) {
       return <Bug className="h-4 w-4 text-[#E3E3E3]" />;
     }
-    if (location.pathname === '/admin-prompts' && (user?.role === 'admin' || user?.role === 'staff')) {
+    if (location.pathname === '/admin-prompts' && (true)) {
       return <Brain className="h-4 w-4 text-[#E3E3E3]" />;
     }

[NoCoverage] EqualityOperator
src/components/Layout/Layout.jsx:102:78
     if ((location.pathname === '/content' || location.pathname.startsWith('/content')) && (user?.role === 'admin' || user?.role === 'staff')) {
       return <Bug className="h-4 w-4 text-[#E3E3E3]" />;
     }
-    if (location.pathname === '/admin-prompts' && (user?.role === 'admin' || user?.role === 'staff')) {
+    if (location.pathname === '/admin-prompts' && (user?.role === 'admin' || user?.role !== 'staff')) {
       return <Brain className="h-4 w-4 text-[#E3E3E3]" />;
     }

[NoCoverage] LogicalOperator
src/components/Layout/Layout.jsx:105:9
     if (location.pathname === '/admin-prompts' && (user?.role === 'admin' || user?.role === 'staff')) {
       return <Brain className="h-4 w-4 text-[#E3E3E3]" />;
     }
-    if ((location.pathname === '/volunteer-feedback' || location.pathname === '/admin-volunteer-feedback') &&
-        (user?.role === 'volunteer' || user?.role === 'admin' || user?.role === 'staff')) {
+    if (location.pathname === '/volunteer-feedback' || location.pathname === '/admin-volunteer-feedback' || user?.role === 'volunteer' || user?.role === 'admin' || user?.role === 'staff') {
       return <MessageCircle className="h-4 w-4 text-[#E3E3E3]" />;
     }

[NoCoverage] LogicalOperator
src/components/Layout/Layout.jsx:105:10
     if (location.pathname === '/admin-prompts' && (user?.role === 'admin' || user?.role === 'staff')) {
       return <Brain className="h-4 w-4 text-[#E3E3E3]" />;
     }
-    if ((location.pathname === '/volunteer-feedback' || location.pathname === '/admin-volunteer-feedback') &&
+    if ((location.pathname === '/volunteer-feedback' && location.pathname === '/admin-volunteer-feedback') &&
         (user?.role === 'volunteer' || user?.role === 'admin' || user?.role === 'staff')) {
       return <MessageCircle className="h-4 w-4 text-[#E3E3E3]" />;

[NoCoverage] OptionalChaining
src/components/Layout/Layout.jsx:106:66
       return <Brain className="h-4 w-4 text-[#E3E3E3]" />;
     }
     if ((location.pathname === '/volunteer-feedback' || location.pathname === '/admin-volunteer-feedback') &&
-        (user?.role === 'volunteer' || user?.role === 'admin' || user?.role === 'staff')) {
+        (user?.role === 'volunteer' || user?.role === 'admin' || user.role === 'staff')) {
       return <MessageCircle className="h-4 w-4 text-[#E3E3E3]" />;
     }

[NoCoverage] OptionalChaining
src/components/Layout/Layout.jsx:106:40
       return <Brain className="h-4 w-4 text-[#E3E3E3]" />;
     }
     if ((location.pathname === '/volunteer-feedback' || location.pathname === '/admin-volunteer-feedback') &&
-        (user?.role === 'volunteer' || user?.role === 'admin' || user?.role === 'staff')) {
+        (user?.role === 'volunteer' || user.role === 'admin' || user?.role === 'staff')) {
       return <MessageCircle className="h-4 w-4 text-[#E3E3E3]" />;
     }

[NoCoverage] LogicalOperator
src/components/Layout/Layout.jsx:110:12
       return <MessageCircle className="h-4 w-4 text-[#E3E3E3]" />;
     }
 
-    return iconMap[location.pathname] || logo;
+    return iconMap[location.pathname] && logo;
   };
 

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:110:12
       return <MessageCircle className="h-4 w-4 text-[#E3E3E3]" />;
     }
 
-    return iconMap[location.pathname] || logo;
+    return true;
   };
 

[NoCoverage] StringLiteral
src/components/Layout/Layout.jsx:122:17
           isMobile
             ? isMobileNavbarOpen
               ? "w-[386px]" // Mobile expanded width (overlay)
-              : "w-0" // Mobile collapsed: completely hidden
+              : "" // Mobile collapsed: completely hidden
             : isNavbarHovered
               ? "w-[250px]" // Desktop expanded width

[NoCoverage] StringLiteral
src/components/Layout/Layout.jsx:124:17
               ? "w-[386px]" // Mobile expanded width (overlay)
               : "w-0" // Mobile collapsed: completely hidden
             : isNavbarHovered
-              ? "w-[250px]" // Desktop expanded width
+              ? "" // Desktop expanded width
               : "w-[50px]" // Desktop collapsed width
         )}

[NoCoverage] BooleanLiteral
src/components/Layout/Layout.jsx:127:29
               ? "w-[250px]" // Desktop expanded width
               : "w-[50px]" // Desktop collapsed width
         )}
-        onMouseEnter={() => !isMobile && setIsNavbarHovered(true)}
+        onMouseEnter={() => isMobile && setIsNavbarHovered(true)}
         onMouseLeave={() => !isMobile && setIsNavbarHovered(false)}
       >

[NoCoverage] BooleanLiteral
src/components/Layout/Layout.jsx:127:61
               ? "w-[250px]" // Desktop expanded width
               : "w-[50px]" // Desktop collapsed width
         )}
-        onMouseEnter={() => !isMobile && setIsNavbarHovered(true)}
+        onMouseEnter={() => !isMobile && setIsNavbarHovered(false)}
         onMouseLeave={() => !isMobile && setIsNavbarHovered(false)}
       >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:128:29
               : "w-[50px]" // Desktop collapsed width
         )}
         onMouseEnter={() => !isMobile && setIsNavbarHovered(true)}
-        onMouseLeave={() => !isMobile && setIsNavbarHovered(false)}
+        onMouseLeave={() => false}
       >
         {/* Mobile Menu Button / Current Page Indicator */}

[Survived] ArrowFunction
src/components/Layout/Layout.jsx:128:23
               : "w-[50px]" // Desktop collapsed width
         )}
         onMouseEnter={() => !isMobile && setIsNavbarHovered(true)}
-        onMouseLeave={() => !isMobile && setIsNavbarHovered(false)}
+        onMouseLeave={() => undefined}
       >
         {/* Mobile Menu Button / Current Page Indicator */}

[NoCoverage] StringLiteral
src/components/Layout/Layout.jsx:137:17
             <button
               onClick={toggleMobileNavbar}
               className={cn(
-                "w-[60px] h-[53px] flex items-center justify-center",
+                "",
                 isMobileNavbarOpen ? "bg-[#4242EA]" : "bg-[#4242EA] hover:bg-blue-600"
               )}

[NoCoverage] EqualityOperator
src/components/Layout/Layout.jsx:141:16
                 isMobileNavbarOpen ? "bg-[#4242EA]" : "bg-[#4242EA] hover:bg-blue-600"
               )}
             >
-              {location.pathname === '/dashboard' ? (
+              {location.pathname !== '/dashboard' ? (
                 <img src={logo} alt="Logo" className="h-5 w-5 object-contain" />
               ) : (

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:141:16
                 isMobileNavbarOpen ? "bg-[#4242EA]" : "bg-[#4242EA] hover:bg-blue-600"
               )}
             >
-              {location.pathname === '/dashboard' ? (
+              {true ? (
                 <img src={logo} alt="Logo" className="h-5 w-5 object-contain" />
               ) : (

[NoCoverage] EqualityOperator
src/components/Layout/Layout.jsx:161:23
                     onClick={closeMobileNavbar}
                     className={cn(
                       "relative h-[53px] flex items-center border-b border-gray-700",
-                      location.pathname === '/dashboard' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                      location.pathname !== '/dashboard' ? "bg-[#4242EA]" : "hover:bg-white/10"
                     )}
                   >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:161:23
                     onClick={closeMobileNavbar}
                     className={cn(
                       "relative h-[53px] flex items-center border-b border-gray-700",
-                      location.pathname === '/dashboard' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                      true ? "bg-[#4242EA]" : "hover:bg-white/10"
                     )}
                   >

[NoCoverage] StringLiteral
src/components/Layout/Layout.jsx:177:23
                     to="/learning"
                     onClick={closeMobileNavbar}
                     className={cn(
-                      "relative h-[53px] flex items-center border-b border-gray-700",
+                      "",
                       location.pathname === '/learning' ? "bg-[#4242EA]" : "hover:bg-white/10"
                     )}

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:178:23
                     onClick={closeMobileNavbar}
                     className={cn(
                       "relative h-[53px] flex items-center border-b border-gray-700",
-                      location.pathname === '/learning' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                      true ? "bg-[#4242EA]" : "hover:bg-white/10"
                     )}
                   >

[NoCoverage] EqualityOperator
src/components/Layout/Layout.jsx:178:23
                     onClick={closeMobileNavbar}
                     className={cn(
                       "relative h-[53px] flex items-center border-b border-gray-700",
-                      location.pathname === '/learning' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                      location.pathname !== '/learning' ? "bg-[#4242EA]" : "hover:bg-white/10"
                     )}
                   >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:201:23
                     onClick={closeMobileNavbar}
                     className={cn(
                       "relative h-[53px] flex items-center border-b border-gray-700",
-                      location.pathname === '/gpt' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                      true ? "bg-[#4242EA]" : "hover:bg-white/10"
                     )}
                   >

[NoCoverage] EqualityOperator
src/components/Layout/Layout.jsx:201:23
                     onClick={closeMobileNavbar}
                     className={cn(
                       "relative h-[53px] flex items-center border-b border-gray-700",
-                      location.pathname === '/gpt' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                      location.pathname !== '/gpt' ? "bg-[#4242EA]" : "hover:bg-white/10"
                     )}
                   >

[NoCoverage] EqualityOperator
src/components/Layout/Layout.jsx:220:23
                     onClick={closeMobileNavbar}
                     className={cn(
                       "relative h-[53px] flex items-center border-b border-gray-700",
-                      location.pathname === '/calendar' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                      location.pathname !== '/calendar' ? "bg-[#4242EA]" : "hover:bg-white/10"
                     )}
                   >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:220:23
                     onClick={closeMobileNavbar}
                     className={cn(
                       "relative h-[53px] flex items-center border-b border-gray-700",
-                      location.pathname === '/calendar' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                      false ? "bg-[#4242EA]" : "hover:bg-white/10"
                     )}
                   >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:242:23
                     onClick={closeMobileNavbar}
                     className={cn(
                       "relative h-[53px] flex items-center border-b border-gray-700",
-                      location.pathname === '/stats' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                      true ? "bg-[#4242EA]" : "hover:bg-white/10"
                     )}
                   >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:242:23
                     onClick={closeMobileNavbar}
                     className={cn(
                       "relative h-[53px] flex items-center border-b border-gray-700",
-                      location.pathname === '/stats' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                      false ? "bg-[#4242EA]" : "hover:bg-white/10"
                     )}
                   >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:261:23
                     onClick={closeMobileNavbar}
                     className={cn(
                       "relative h-[53px] flex items-center border-b border-gray-700",
-                      location.pathname === '/assessment' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                      true ? "bg-[#4242EA]" : "hover:bg-white/10"
                     )}
                   >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:261:23
                     onClick={closeMobileNavbar}
                     className={cn(
                       "relative h-[53px] flex items-center border-b border-gray-700",
-                      location.pathname === '/assessment' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                      false ? "bg-[#4242EA]" : "hover:bg-white/10"
                     )}
                   >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:279:21
                   </Link>
 
                   {/* Admin Items */}
-                  {(user?.role === 'admin' || user?.role === 'staff') && (
+                  {(true) && (
                     <>
                       {/* Admin Dashboard */}

[NoCoverage] LogicalOperator
src/components/Layout/Layout.jsx:279:21
                   </Link>
 
                   {/* Admin Items */}
-                  {(user?.role === 'admin' || user?.role === 'staff') && (
+                  {(user?.role === 'admin' && user?.role === 'staff') && (
                     <>
                       {/* Admin Dashboard */}

[NoCoverage] EqualityOperator
src/components/Layout/Layout.jsx:287:27
                         onClick={closeMobileNavbar}
                         className={cn(
                           "relative h-[53px] flex items-center border-b border-gray-700",
-                          location.pathname === '/admin-dashboard' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                          location.pathname !== '/admin-dashboard' ? "bg-[#4242EA]" : "hover:bg-white/10"
                         )}
                       >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:287:27
                         onClick={closeMobileNavbar}
                         className={cn(
                           "relative h-[53px] flex items-center border-b border-gray-700",
-                          location.pathname === '/admin-dashboard' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                          false ? "bg-[#4242EA]" : "hover:bg-white/10"
                         )}
                       >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:304:27
                         onClick={closeMobileNavbar}
                         className={cn(
                           "relative h-[53px] flex items-center border-b border-gray-700",
-                          location.pathname === '/admin/assessment-grades' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                          false ? "bg-[#4242EA]" : "hover:bg-white/10"
                         )}
                       >

[NoCoverage] EqualityOperator
src/components/Layout/Layout.jsx:304:27
                         onClick={closeMobileNavbar}
                         className={cn(
                           "relative h-[53px] flex items-center border-b border-gray-700",
-                          location.pathname === '/admin/assessment-grades' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                          location.pathname !== '/admin/assessment-grades' ? "bg-[#4242EA]" : "hover:bg-white/10"
                         )}
                       >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:321:27
                         onClick={closeMobileNavbar}
                         className={cn(
                           "relative h-[53px] flex items-center border-b border-gray-700",
-                          location.pathname === '/admissions-dashboard' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                          true ? "bg-[#4242EA]" : "hover:bg-white/10"
                         )}
                       >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:321:27
                         onClick={closeMobileNavbar}
                         className={cn(
                           "relative h-[53px] flex items-center border-b border-gray-700",
-                          location.pathname === '/admissions-dashboard' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                          false ? "bg-[#4242EA]" : "hover:bg-white/10"
                         )}
                       >

[NoCoverage] EqualityOperator
src/components/Layout/Layout.jsx:338:28
                         onClick={closeMobileNavbar}
                         className={cn(
                           "relative h-[53px] flex items-center border-b border-gray-700",
-                          (location.pathname === '/content' || location.pathname.startsWith('/content')) ? "bg-[#4242EA]" : "hover:bg-white/10"
+                          (location.pathname !== '/content' || location.pathname.startsWith('/content')) ? "bg-[#4242EA]" : "hover:bg-white/10"
                         )}
                       >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:338:28
                         onClick={closeMobileNavbar}
                         className={cn(
                           "relative h-[53px] flex items-center border-b border-gray-700",
-                          (location.pathname === '/content' || location.pathname.startsWith('/content')) ? "bg-[#4242EA]" : "hover:bg-white/10"
+                          (false) ? "bg-[#4242EA]" : "hover:bg-white/10"
                         )}
                       >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:355:27
                         onClick={closeMobileNavbar}
                         className={cn(
                           "relative h-[53px] flex items-center border-b border-gray-700",
-                          location.pathname === '/admin-prompts' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                          false ? "bg-[#4242EA]" : "hover:bg-white/10"
                         )}
                       >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:355:27
                         onClick={closeMobileNavbar}
                         className={cn(
                           "relative h-[53px] flex items-center border-b border-gray-700",
-                          location.pathname === '/admin-prompts' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                          true ? "bg-[#4242EA]" : "hover:bg-white/10"
                         )}
                       >

[NoCoverage] EqualityOperator
src/components/Layout/Layout.jsx:369:51
                   )}
 
                   {/* Volunteer Feedback */}
-                  {(user?.role === 'volunteer' || user?.role === 'admin' || user?.role === 'staff') && (
+                  {(user?.role === 'volunteer' || user?.role !== 'admin' || user?.role === 'staff') && (
                     <Link
                       to={user?.role === 'volunteer' ? '/volunteer-feedback' : '/admin-volunteer-feedback'}

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:369:21
                   )}
 
                   {/* Volunteer Feedback */}
-                  {(user?.role === 'volunteer' || user?.role === 'admin' || user?.role === 'staff') && (
+                  {(true) && (
                     <Link
                       to={user?.role === 'volunteer' ? '/volunteer-feedback' : '/admin-volunteer-feedback'}

[NoCoverage] OptionalChaining
src/components/Layout/Layout.jsx:371:27
                   {/* Volunteer Feedback */}
                   {(user?.role === 'volunteer' || user?.role === 'admin' || user?.role === 'staff') && (
                     <Link
-                      to={user?.role === 'volunteer' ? '/volunteer-feedback' : '/admin-volunteer-feedback'}
+                      to={user.role === 'volunteer' ? '/volunteer-feedback' : '/admin-volunteer-feedback'}
                       onClick={closeMobileNavbar}
                       className={cn(
