[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:371:27
                   {/* Volunteer Feedback */}
                   {(user?.role === 'volunteer' || user?.role === 'admin' || user?.role === 'staff') && (
                     <Link
-                      to={user?.role === 'volunteer' ? '/volunteer-feedback' : '/admin-volunteer-feedback'}
+                      to={false ? '/volunteer-feedback' : '/admin-volunteer-feedback'}
                       onClick={closeMobileNavbar}
                       className={cn(

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:375:26
                       onClick={closeMobileNavbar}
                       className={cn(
                         "relative h-[53px] flex items-center border-b border-gray-700",
-                        (location.pathname === '/volunteer-feedback' || location.pathname === '/admin-volunteer-feedback') ? "bg-[#4242EA]" : "hover:bg-white/10"
+                        (false) ? "bg-[#4242EA]" : "hover:bg-white/10"
                       )}
                     >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:375:26
                       onClick={closeMobileNavbar}
                       className={cn(
                         "relative h-[53px] flex items-center border-b border-gray-700",
-                        (location.pathname === '/volunteer-feedback' || location.pathname === '/admin-volunteer-feedback') ? "bg-[#4242EA]" : "hover:bg-white/10"
+                        (false || location.pathname === '/admin-volunteer-feedback') ? "bg-[#4242EA]" : "hover:bg-white/10"
                       )}
                     >

[NoCoverage] EqualityOperator
src/components/Layout/Layout.jsx:393:23
                     onClick={closeMobileNavbar}
                     className={cn(
                       "relative h-[53px] flex items-center border-b border-gray-700",
-                      location.pathname === '/account' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                      location.pathname !== '/account' ? "bg-[#4242EA]" : "hover:bg-white/10"
                     )}
                   >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:393:23
                     onClick={closeMobileNavbar}
                     className={cn(
                       "relative h-[53px] flex items-center border-b border-gray-700",
-                      location.pathname === '/account' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                      false ? "bg-[#4242EA]" : "hover:bg-white/10"
                     )}
                   >

[NoCoverage] BlockStatement
src/components/Layout/Layout.jsx:409:36
 
                   {/* Logout */}
                   <button
-                    onClick={() => {
-                      handleLogout();
-                      closeMobileNavbar();
-                    }}
+                    onClick={() => {}}
                     className="relative h-[53px] flex items-center hover:bg-white/10 text-[#E3E3E3] w-full text-left"
                   >

[Survived] EqualityOperator
src/components/Layout/Layout.jsx:444:15
             to="/dashboard"
             className={cn(
               "relative h-[44px] flex items-center",
-              location.pathname === '/dashboard' ? "bg-[#4242EA]" : "hover:bg-white/10"
+              location.pathname !== '/dashboard' ? "bg-[#4242EA]" : "hover:bg-white/10"
             )}
           >

[Survived] ConditionalExpression
src/components/Layout/Layout.jsx:444:15
             to="/dashboard"
             className={cn(
               "relative h-[44px] flex items-center",
-              location.pathname === '/dashboard' ? "bg-[#4242EA]" : "hover:bg-white/10"
+              false ? "bg-[#4242EA]" : "hover:bg-white/10"
             )}
           >

[Survived] StringLiteral
src/components/Layout/Layout.jsx:456:17
             </div>
             <div
               className={cn(
-                "flex items-center transition-all duration-300 ease-in-out",
+                "",
                 isNavbarHovered ? "ml-[50px] opacity-100" : "ml-[50px] opacity-0 w-0 overflow-hidden"
               )}

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:473:17
               onClick={closeMobileNavbar}
               className={cn(
                 "relative h-[53px] flex items-center",
-                location.pathname === '/learning' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                false ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:473:17
               onClick={closeMobileNavbar}
               className={cn(
                 "relative h-[53px] flex items-center",
-                location.pathname === '/learning' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                true ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >

[Survived] StringLiteral
src/components/Layout/Layout.jsx:494:15
           <Link
             to="/learning"
             className={cn(
-              "relative h-[44px] flex items-center",
+              "",
               location.pathname === '/learning' ? "bg-[#4242EA]" : "hover:bg-white/10"
             )}

[Survived] ConditionalExpression
src/components/Layout/Layout.jsx:495:15
             to="/learning"
             className={cn(
               "relative h-[44px] flex items-center",
-              location.pathname === '/learning' ? "bg-[#4242EA]" : "hover:bg-white/10"
+              true ? "bg-[#4242EA]" : "hover:bg-white/10"
             )}
           >

[Survived] ConditionalExpression
src/components/Layout/Layout.jsx:495:15
             to="/learning"
             className={cn(
               "relative h-[44px] flex items-center",
-              location.pathname === '/learning' ? "bg-[#4242EA]" : "hover:bg-white/10"
+              false ? "bg-[#4242EA]" : "hover:bg-white/10"
             )}
           >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:526:17
               onClick={closeMobileNavbar}
               className={cn(
                 "relative h-[53px] flex items-center",
-                location.pathname === '/gpt' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                true ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >

[NoCoverage] EqualityOperator
src/components/Layout/Layout.jsx:526:17
               onClick={closeMobileNavbar}
               className={cn(
                 "relative h-[53px] flex items-center",
-                location.pathname === '/gpt' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                location.pathname !== '/gpt' ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >

[Survived] ConditionalExpression
src/components/Layout/Layout.jsx:544:15
             to="/gpt"
             className={cn(
               "relative h-[44px] flex items-center",
-              location.pathname === '/gpt' ? "bg-[#4242EA]" : "hover:bg-white/10"
+              false ? "bg-[#4242EA]" : "hover:bg-white/10"
             )}
           >

[Survived] EqualityOperator
src/components/Layout/Layout.jsx:544:15
             to="/gpt"
             className={cn(
               "relative h-[44px] flex items-center",
-              location.pathname === '/gpt' ? "bg-[#4242EA]" : "hover:bg-white/10"
+              location.pathname !== '/gpt' ? "bg-[#4242EA]" : "hover:bg-white/10"
             )}
           >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:565:11
 
         {/* Calendar - Only show in expanded mobile navbar */}
         {isMobile ? (
-          isMobileNavbarOpen && (
-            <Link
-              to="/calendar"
-              onClick={closeMobileNavbar}
-              className={cn(
-                "relative h-[53px] flex items-center",
-                location.pathname === '/calendar' ? "bg-[#4242EA]" : "hover:bg-white/10"
-              )}
-            >
-              <div className="absolute left-0 top-0 w-[60px] h-[53px] flex items-center justify-center">
-                <svg width="16" height="16" viewBox="0 0 24 24" fill="none">
-                  <rect x="3" y="4" width="18" height="18" rx="2" ry="2" stroke="#E3E3E3" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
-                  <line x1="16" y1="2" x2="16" y2="6" stroke="#E3E3E3" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
-                  <line x1="8" y1="2" x2="8" y2="6" stroke="#E3E3E3" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
-                  <line x1="3" y1="10" x2="21" y2="10" stroke="#E3E3E3" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
-                </svg>
-              </div>
-              <div className="flex items-center ml-[60px]">
-                <span className="text-white text-sm font-medium whitespace-nowrap">Calendar</span>
-              </div>
-            </Link>
-          )
+          false
         ) : (
           <Link

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:565:11
 
         {/* Calendar - Only show in expanded mobile navbar */}
         {isMobile ? (
-          isMobileNavbarOpen && (
-            <Link
-              to="/calendar"
-              onClick={closeMobileNavbar}
-              className={cn(
-                "relative h-[53px] flex items-center",
-                location.pathname === '/calendar' ? "bg-[#4242EA]" : "hover:bg-white/10"
-              )}
-            >
-              <div className="absolute left-0 top-0 w-[60px] h-[53px] flex items-center justify-center">
-                <svg width="16" height="16" viewBox="0 0 24 24" fill="none">
-                  <rect x="3" y="4" width="18" height="18" rx="2" ry="2" stroke="#E3E3E3" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
-                  <line x1="16" y1="2" x2="16" y2="6" stroke="#E3E3E3" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
-                  <line x1="8" y1="2" x2="8" y2="6" stroke="#E3E3E3" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
-                  <line x1="3" y1="10" x2="21" y2="10" stroke="#E3E3E3" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
-                </svg>
-              </div>
-              <div className="flex items-center ml-[60px]">
-                <span className="text-white text-sm font-medium whitespace-nowrap">Calendar</span>
-              </div>
-            </Link>
-          )
+          true
         ) : (
           <Link

[NoCoverage] EqualityOperator
src/components/Layout/Layout.jsx:571:17
               onClick={closeMobileNavbar}
               className={cn(
                 "relative h-[53px] flex items-center",
-                location.pathname === '/calendar' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                location.pathname !== '/calendar' ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:571:17
               onClick={closeMobileNavbar}
               className={cn(
                 "relative h-[53px] flex items-center",
-                location.pathname === '/calendar' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                true ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >

[Survived] EqualityOperator
src/components/Layout/Layout.jsx:592:15
             to="/calendar"
             className={cn(
               "relative h-[44px] flex items-center",
-              location.pathname === '/calendar' ? "bg-[#4242EA]" : "hover:bg-white/10"
+              location.pathname !== '/calendar' ? "bg-[#4242EA]" : "hover:bg-white/10"
             )}
           >

[Survived] ConditionalExpression
src/components/Layout/Layout.jsx:592:15
             to="/calendar"
             className={cn(
               "relative h-[44px] flex items-center",
-              location.pathname === '/calendar' ? "bg-[#4242EA]" : "hover:bg-white/10"
+              true ? "bg-[#4242EA]" : "hover:bg-white/10"
             )}
           >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:616:11
 
         {/* Progress - Only show in expanded mobile navbar */}
         {isMobile ? (
-          isMobileNavbarOpen && (
-            <Link
-              to="/stats"
-              onClick={closeMobileNavbar}
-              className={cn(
-                "relative h-[53px] flex items-center",
-                location.pathname === '/stats' ? "bg-[#4242EA]" : "hover:bg-white/10"
-              )}
-            >
-              <div className="absolute left-0 top-0 w-[60px] h-[53px] flex items-center justify-center">
-                <svg width="16" height="16" viewBox="0 0 24 24" fill="none">
-                  <polyline points="22,12 18,12 15,21 9,3 6,12 2,12" stroke="#E3E3E3" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
-                </svg>
-              </div>
-              <div className="flex items-center ml-[60px]">
-                <span className="text-white text-sm font-medium whitespace-nowrap">Progress</span>
-              </div>
-            </Link>
-          )
+          true
         ) : (
           <Link

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:616:11
 
         {/* Progress - Only show in expanded mobile navbar */}
         {isMobile ? (
-          isMobileNavbarOpen && (
-            <Link
-              to="/stats"
-              onClick={closeMobileNavbar}
-              className={cn(
-                "relative h-[53px] flex items-center",
-                location.pathname === '/stats' ? "bg-[#4242EA]" : "hover:bg-white/10"
-              )}
-            >
-              <div className="absolute left-0 top-0 w-[60px] h-[53px] flex items-center justify-center">
-                <svg width="16" height="16" viewBox="0 0 24 24" fill="none">
-                  <polyline points="22,12 18,12 15,21 9,3 6,12 2,12" stroke="#E3E3E3" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
-                </svg>
-              </div>
-              <div className="flex items-center ml-[60px]">
-                <span className="text-white text-sm font-medium whitespace-nowrap">Progress</span>
-              </div>
-            </Link>
-          )
+          false
         ) : (
           <Link

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:622:17
               onClick={closeMobileNavbar}
               className={cn(
                 "relative h-[53px] flex items-center",
-                location.pathname === '/stats' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                false ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:622:17
               onClick={closeMobileNavbar}
               className={cn(
                 "relative h-[53px] flex items-center",
-                location.pathname === '/stats' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                true ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >

[Survived] ConditionalExpression
src/components/Layout/Layout.jsx:640:15
             to="/stats"
             className={cn(
               "relative h-[44px] flex items-center",
-              location.pathname === '/stats' ? "bg-[#4242EA]" : "hover:bg-white/10"
+              false ? "bg-[#4242EA]" : "hover:bg-white/10"
             )}
           >

[Survived] ConditionalExpression
src/components/Layout/Layout.jsx:640:15
             to="/stats"
             className={cn(
               "relative h-[44px] flex items-center",
-              location.pathname === '/stats' ? "bg-[#4242EA]" : "hover:bg-white/10"
+              true ? "bg-[#4242EA]" : "hover:bg-white/10"
             )}
           >

[Survived] StringLiteral
src/components/Layout/Layout.jsx:651:61
             <div
               className={cn(
                 "flex items-center transition-all duration-300 ease-in-out",
-                isNavbarHovered ? "ml-[50px] opacity-100" : "ml-[50px] opacity-0 w-0 overflow-hidden"
+                isNavbarHovered ? "ml-[50px] opacity-100" : ""
               )}
             >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:661:11
 
         {/* Assessment - Only show in expanded mobile navbar */}
         {isMobile ? (
-          isMobileNavbarOpen && (
-            <Link
-              to="/assessment"
-              onClick={closeMobileNavbar}
-              className={cn(
-                "relative h-[53px] flex items-center",
-                location.pathname === '/assessment' ? "bg-[#4242EA]" : "hover:bg-white/10"
-              )}
-            >
-              <div className="absolute left-0 top-0 w-[60px] h-[53px] flex items-center justify-center">
-                <svg width="16" height="16" viewBox="0 0 24 24" fill="none">
-                  <path d="M14 2H6C4.9 2 4 2.9 4 4V20C4 21.1 4.89 22 5.99 22H18C19.1 22 20 21.1 20 20V8L14 2Z" stroke="#E3E3E3" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
-                  <polyline points="14,2 14,8 20,8" stroke="#E3E3E3" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
-                  <line x1="16" y1="13" x2="8" y2="13" stroke="#E3E3E3" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
-                  <line x1="16" y1="17" x2="8" y2="17" stroke="#E3E3E3" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
-                  <polyline points="10,9 9,9 8,9" stroke="#E3E3E3" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
-                </svg>
-              </div>
-              <div className="flex items-center ml-[60px]">
-                <span className="text-white text-sm font-medium whitespace-nowrap">Assessment</span>
-              </div>
-            </Link>
-          )
+          true
         ) : (
           <Link

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:661:11
 
         {/* Assessment - Only show in expanded mobile navbar */}
         {isMobile ? (
-          isMobileNavbarOpen && (
-            <Link
-              to="/assessment"
-              onClick={closeMobileNavbar}
-              className={cn(
-                "relative h-[53px] flex items-center",
-                location.pathname === '/assessment' ? "bg-[#4242EA]" : "hover:bg-white/10"
-              )}
-            >
-              <div className="absolute left-0 top-0 w-[60px] h-[53px] flex items-center justify-center">
-                <svg width="16" height="16" viewBox="0 0 24 24" fill="none">
-                  <path d="M14 2H6C4.9 2 4 2.9 4 4V20C4 21.1 4.89 22 5.99 22H18C19.1 22 20 21.1 20 20V8L14 2Z" stroke="#E3E3E3" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
-                  <polyline points="14,2 14,8 20,8" stroke="#E3E3E3" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
-                  <line x1="16" y1="13" x2="8" y2="13" stroke="#E3E3E3" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
-                  <line x1="16" y1="17" x2="8" y2="17" stroke="#E3E3E3" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
-                  <polyline points="10,9 9,9 8,9" stroke="#E3E3E3" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
-                </svg>
-              </div>
-              <div className="flex items-center ml-[60px]">
-                <span className="text-white text-sm font-medium whitespace-nowrap">Assessment</span>
-              </div>
-            </Link>
-          )
+          false
         ) : (
           <Link

[NoCoverage] StringLiteral
src/components/Layout/Layout.jsx:666:17
               to="/assessment"
               onClick={closeMobileNavbar}
               className={cn(
-                "relative h-[53px] flex items-center",
+                "",
                 location.pathname === '/assessment' ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:667:17
               onClick={closeMobileNavbar}
               className={cn(
                 "relative h-[53px] flex items-center",
-                location.pathname === '/assessment' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                true ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:667:17
               onClick={closeMobileNavbar}
               className={cn(
                 "relative h-[53px] flex items-center",
-                location.pathname === '/assessment' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                false ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >

[Survived] EqualityOperator
src/components/Layout/Layout.jsx:689:15
             to="/assessment"
             className={cn(
               "relative h-[44px] flex items-center",
-              location.pathname === '/assessment' ? "bg-[#4242EA]" : "hover:bg-white/10"
+              location.pathname !== '/assessment' ? "bg-[#4242EA]" : "hover:bg-white/10"
             )}
           >

[Survived] ConditionalExpression
src/components/Layout/Layout.jsx:689:15
             to="/assessment"
             className={cn(
               "relative h-[44px] flex items-center",
-              location.pathname === '/assessment' ? "bg-[#4242EA]" : "hover:bg-white/10"
+              false ? "bg-[#4242EA]" : "hover:bg-white/10"
             )}
           >

[NoCoverage] StringLiteral
src/components/Layout/Layout.jsx:704:35
             <div
               className={cn(
                 "flex items-center transition-all duration-300 ease-in-out",
-                isNavbarHovered ? "ml-[50px] opacity-100" : "ml-[50px] opacity-0 w-0 overflow-hidden"
+                isNavbarHovered ? "" : "ml-[50px] opacity-0 w-0 overflow-hidden"
               )}
             >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:714:12
 
         {/* Admin Dashboard - Only show for admins and only in expanded mobile navbar */}
         {isMobile ? (
-          (user?.role === 'admin' || user?.role === 'staff') && isMobileNavbarOpen && (
+          (true) && isMobileNavbarOpen && (
             <Link
               to="/admin-dashboard"

[NoCoverage] EqualityOperator
src/components/Layout/Layout.jsx:714:38
 
         {/* Admin Dashboard - Only show for admins and only in expanded mobile navbar */}
         {isMobile ? (
-          (user?.role === 'admin' || user?.role === 'staff') && isMobileNavbarOpen && (
+          (user?.role === 'admin' || user?.role !== 'staff') && isMobileNavbarOpen && (
             <Link
               to="/admin-dashboard"

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:720:17
               onClick={closeMobileNavbar}
               className={cn(
                 "relative h-[53px] flex items-center",
-                location.pathname === '/admin-dashboard' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                false ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >

[NoCoverage] EqualityOperator
src/components/Layout/Layout.jsx:720:17
               onClick={closeMobileNavbar}
               className={cn(
                 "relative h-[53px] flex items-center",
-                location.pathname === '/admin-dashboard' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                location.pathname !== '/admin-dashboard' ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >

[Killed] ConditionalExpression
src/components/Layout/Layout.jsx:732:11
             </Link>
           )
         ) : (
-          (user?.role === 'admin' || user?.role === 'staff') && (
-            <Link
-              to="/admin-dashboard"
-              className={cn(
-                "relative h-[44px] flex items-center",
-                location.pathname === '/admin-dashboard' ? "bg-[#4242EA]" : "hover:bg-white/10"
-              )}
-            >
-              <div className="absolute left-0 top-0 w-[50px] h-[44px] flex items-center justify-center">
-                <Settings className="h-4 w-4 text-[#E3E3E3]" />
-              </div>
-              <div
-                className={cn(
-                  "flex items-center transition-all duration-300 ease-in-out",
-                  isNavbarHovered ? "ml-[50px] opacity-100" : "ml-[50px] opacity-0 w-0 overflow-hidden"
-                )}
-              >
-                <span className="text-white text-sm font-medium whitespace-nowrap">Admin Dashboard</span>
-              </div>
-            </Link>
-          )
+          true
         )}
 
killedBy: Dashboard - Role-Based Access Control Staff Role should show ALL admin navigation items for staff
statusReason: Unable to find an element with the text: Admin Dashboard. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex h-screen w-full bg-background"
    >

[Killed] ConditionalExpression
src/components/Layout/Layout.jsx:732:12
             </Link>
           )
         ) : (
-          (user?.role === 'admin' || user?.role === 'staff') && (
+          (false || user?.role === 'staff') && (
             <Link
               to="/admin-dashboard"
killedBy: Dashboard - Role-Based Access Control Admin Role should show ALL admin navigation items for admins
statusReason: Unable to find an element with the text: Admin Dashboard. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex h-screen w-full bg-background"
    >

[Survived] EqualityOperator
src/components/Layout/Layout.jsx:737:17
               to="/admin-dashboard"
               className={cn(
                 "relative h-[44px] flex items-center",
-                location.pathname === '/admin-dashboard' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                location.pathname !== '/admin-dashboard' ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >

[Survived] ConditionalExpression
src/components/Layout/Layout.jsx:737:17
               to="/admin-dashboard"
               className={cn(
                 "relative h-[44px] flex items-center",
-                location.pathname === '/admin-dashboard' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                false ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:757:11
 
         {/* Assessment Grades - Only show for admins and only in expanded mobile navbar */}
         {isMobile ? (
-          (user?.role === 'admin' || user?.role === 'staff') && isMobileNavbarOpen && (
-            <Link
-              to="/admin/assessment-grades"
-              onClick={closeMobileNavbar}
-              className={cn(
-                "relative h-[53px] flex items-center",
-                location.pathname === '/admin/assessment-grades' ? "bg-[#4242EA]" : "hover:bg-white/10"
-              )}
-            >
-              <div className="absolute left-0 top-0 w-[60px] h-[53px] flex items-center justify-center">
-                <Award className="h-4 w-4 text-[#E3E3E3]" />
-              </div>
-              <div className="flex items-center ml-[60px]">
-                <span className="text-white text-sm font-medium whitespace-nowrap">Assessment Grades</span>
-              </div>
-            </Link>
-          )
+          true
         ) : (
           (user?.role === 'admin' || user?.role === 'staff') && (

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:757:11
 
         {/* Assessment Grades - Only show for admins and only in expanded mobile navbar */}
         {isMobile ? (
-          (user?.role === 'admin' || user?.role === 'staff') && isMobileNavbarOpen && (
+          true && (
             <Link
               to="/admin/assessment-grades"

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:763:17
               onClick={closeMobileNavbar}
               className={cn(
                 "relative h-[53px] flex items-center",
-                location.pathname === '/admin/assessment-grades' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                false ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:763:17
               onClick={closeMobileNavbar}
               className={cn(
                 "relative h-[53px] flex items-center",
-                location.pathname === '/admin/assessment-grades' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                true ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >
