[Survived] ArithmeticOperator
src/pages/Dashboard/Dashboard.jsx:167:17
       const cache = {};
       allWeeksData.forEach((days, index) => {
         if (days) {
-          cache[index + 1] = days; // week number is index + 1
+          cache[index - 1] = days; // week number is index + 1
         }
       });

[Survived] BlockStatement
src/pages/Dashboard/Dashboard.jsx:172:21
       });
       
       setWeekCache(cache);
-    } catch (error) {
-      console.error('Error preloading weeks:', error);
-    }
+    } catch (error) {}
   };
 

[Killed] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:180:11
   const fetchWeekData = async (weekNumber) => {
     try {
       // Check cache first
-      if (weekCache[weekNumber]) {
+      if (true) {
         const days = weekCache[weekNumber];
         setWeekData(days);
killedBy: Dashboard - Role-Based Access Control Student/Builder Role should render dashboard content for active students
statusReason: Unable to find an element with the text: /Hey John. Good to see you!/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:180:11
   const fetchWeekData = async (weekNumber) => {
     try {
       // Check cache first
-      if (weekCache[weekNumber]) {
+      if (false) {
         const days = weekCache[weekNumber];
         setWeekData(days);

[NoCoverage] LogicalOperator
src/pages/Dashboard/Dashboard.jsx:185:13
         setWeekData(days);
         
         // Update weekly goal from the first day of the week
-        if (days && days.length > 0 && days[0].weekly_goal) {
+        if (days && days.length > 0 || days[0].weekly_goal) {
           setWeeklyGoal(days[0].weekly_goal);
         }

[NoCoverage] LogicalOperator
src/pages/Dashboard/Dashboard.jsx:185:13
         setWeekData(days);
         
         // Update weekly goal from the first day of the week
-        if (days && days.length > 0 && days[0].weekly_goal) {
+        if (days || days.length > 0 && days[0].weekly_goal) {
           setWeeklyGoal(days[0].weekly_goal);
         }

[Survived] LogicalOperator
src/pages/Dashboard/Dashboard.jsx:192:27
       }
       
       // If not in cache, fetch it
-      const cohortParam = (user?.role === 'staff' || user?.role === 'admin') && cohortFilter
+      const cohortParam = user?.role === 'staff' || user?.role === 'admin' || cohortFilter
         ? `?cohort=${encodeURIComponent(cohortFilter)}`
         : '';

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:192:28
       }
       
       // If not in cache, fetch it
-      const cohortParam = (user?.role === 'staff' || user?.role === 'admin') && cohortFilter
+      const cohortParam = (false || user?.role === 'admin') && cohortFilter
         ? `?cohort=${encodeURIComponent(cohortFilter)}`
         : '';

[Survived] StringLiteral
src/pages/Dashboard/Dashboard.jsx:194:11
       // If not in cache, fetch it
       const cohortParam = (user?.role === 'staff' || user?.role === 'admin') && cohortFilter
         ? `?cohort=${encodeURIComponent(cohortFilter)}`
-        : '';
+        : "Stryker was here!";
       
       const response = await fetch(

[NoCoverage] BlockStatement
src/pages/Dashboard/Dashboard.jsx:205:25
         }
       );
       
-      if (!response.ok) {
-        throw new Error('Failed to fetch week data');
-      }
+      if (!response.ok) {}
       
       const days = await response.json();

[NoCoverage] ArrowFunction
src/pages/Dashboard/Dashboard.jsx:213:20
       setWeekData(days);
       
       // Add to cache
-      setWeekCache(prev => ({ ...prev, [weekNumber]: days }));
+      setWeekCache(() => undefined);
       
       // Update weekly goal from the first day of the week

[NoCoverage] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:216:11
       setWeekCache(prev => ({ ...prev, [weekNumber]: days }));
       
       // Update weekly goal from the first day of the week
-      if (days && days.length > 0 && days[0].weekly_goal) {
+      if (false) {
         setWeeklyGoal(days[0].weekly_goal);
       }

[NoCoverage] BlockStatement
src/pages/Dashboard/Dashboard.jsx:216:59
       setWeekCache(prev => ({ ...prev, [weekNumber]: days }));
       
       // Update weekly goal from the first day of the week
-      if (days && days.length > 0 && days[0].weekly_goal) {
-        setWeeklyGoal(days[0].weekly_goal);
-      }
+      if (days && days.length > 0 && days[0].weekly_goal) {}
     } catch (error) {
       console.error('Error fetching week data:', error);

[Survived] BlockStatement
src/pages/Dashboard/Dashboard.jsx:219:21
       if (days && days.length > 0 && days[0].weekly_goal) {
         setWeeklyGoal(days[0].weekly_goal);
       }
-    } catch (error) {
-      console.error('Error fetching week data:', error);
-    }
+    } catch (error) {}
   };
 

[Survived] StringLiteral
src/pages/Dashboard/Dashboard.jsx:220:21
         setWeeklyGoal(days[0].weekly_goal);
       }
     } catch (error) {
-      console.error('Error fetching week data:', error);
+      console.error("", error);
     }
   };

[NoCoverage] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:225:9
   };
 
   const navigateToWeek = async (direction) => {
-    if (!currentWeek || isLoadingWeek) return;
+    if (false) return;
     
     const newWeek = direction === 'prev' ? currentWeek - 1 : currentWeek + 1;

[NoCoverage] BooleanLiteral
src/pages/Dashboard/Dashboard.jsx:225:9
   };
 
   const navigateToWeek = async (direction) => {
-    if (!currentWeek || isLoadingWeek) return;
+    if (currentWeek || isLoadingWeek) return;
     
     const newWeek = direction === 'prev' ? currentWeek - 1 : currentWeek + 1;

[NoCoverage] ArithmeticOperator
src/pages/Dashboard/Dashboard.jsx:227:62
   const navigateToWeek = async (direction) => {
     if (!currentWeek || isLoadingWeek) return;
     
-    const newWeek = direction === 'prev' ? currentWeek - 1 : currentWeek + 1;
+    const newWeek = direction === 'prev' ? currentWeek - 1 : currentWeek - 1;
     
     // Don't go below week 1

[NoCoverage] EqualityOperator
src/pages/Dashboard/Dashboard.jsx:227:21
   const navigateToWeek = async (direction) => {
     if (!currentWeek || isLoadingWeek) return;
     
-    const newWeek = direction === 'prev' ? currentWeek - 1 : currentWeek + 1;
+    const newWeek = direction !== 'prev' ? currentWeek - 1 : currentWeek + 1;
     
     // Don't go below week 1

[NoCoverage] EqualityOperator
src/pages/Dashboard/Dashboard.jsx:230:9
     const newWeek = direction === 'prev' ? currentWeek - 1 : currentWeek + 1;
     
     // Don't go below week 1
-    if (newWeek < 1) return;
+    if (newWeek >= 1) return;
     
     // Don't go past the current week (the week from currentDay)

[NoCoverage] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:230:9
     const newWeek = direction === 'prev' ? currentWeek - 1 : currentWeek + 1;
     
     // Don't go below week 1
-    if (newWeek < 1) return;
+    if (true) return;
     
     // Don't go past the current week (the week from currentDay)

[NoCoverage] BlockStatement
src/pages/Dashboard/Dashboard.jsx:233:80
     if (newWeek < 1) return;
     
     // Don't go past the current week (the week from currentDay)
-    if (direction === 'next' && currentDay?.week && newWeek > currentDay.week) {
-      return;
-    }
+    if (direction === 'next' && currentDay?.week && newWeek > currentDay.week) {}
     
     console.log('🎬 Navigate to week:', direction, 'New week:', newWeek);

[NoCoverage] EqualityOperator
src/pages/Dashboard/Dashboard.jsx:233:53
     if (newWeek < 1) return;
     
     // Don't go past the current week (the week from currentDay)
-    if (direction === 'next' && currentDay?.week && newWeek > currentDay.week) {
+    if (direction === 'next' && currentDay?.week && newWeek <= currentDay.week) {
       return;
     }

[NoCoverage] StringLiteral
src/pages/Dashboard/Dashboard.jsx:237:52
       return;
     }
     
-    console.log('🎬 Navigate to week:', direction, 'New week:', newWeek);
+    console.log('🎬 Navigate to week:', direction, '"" newWeek);
     
     // Phase 1: Slide out old cards

[NoCoverage] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:240:31
     console.log('🎬 Navigate to week:', direction, 'New week:', newWeek);
     
     // Phase 1: Slide out old cards
-    const slideOutDirection = direction === 'prev' ? 'out-left' : 'out-right';
+    const slideOutDirection = true ? 'out-left' : 'out-right';
     setSlideDirection(slideOutDirection);
     console.log('📤 Slide OUT direction:', slideOutDirection);

[NoCoverage] EqualityOperator
src/pages/Dashboard/Dashboard.jsx:240:31
     console.log('🎬 Navigate to week:', direction, 'New week:', newWeek);
     
     // Phase 1: Slide out old cards
-    const slideOutDirection = direction === 'prev' ? 'out-left' : 'out-right';
+    const slideOutDirection = direction !== 'prev' ? 'out-left' : 'out-right';
     setSlideDirection(slideOutDirection);
     console.log('📤 Slide OUT direction:', slideOutDirection);

[NoCoverage] ArrowFunction
src/pages/Dashboard/Dashboard.jsx:245:23
     console.log('📤 Slide OUT direction:', slideOutDirection);
     
     // Wait for slide-out animation (0.6s animation + 0.4s for 5 card stagger)
-    await new Promise(resolve => setTimeout(resolve, 1000));
+    await new Promise(() => undefined);
     
     // Phase 2: Fetch new data while cards are off-screen

[NoCoverage] EqualityOperator
src/pages/Dashboard/Dashboard.jsx:252:30
     await fetchWeekData(newWeek);
     
     // Phase 3: Slide in new cards from opposite direction
-    const slideInDirection = direction === 'prev' ? 'in-from-right' : 'in-from-left';
+    const slideInDirection = direction !== 'prev' ? 'in-from-right' : 'in-from-left';
     console.log('📥 Slide IN direction:', slideInDirection);
     setSlideDirection(slideInDirection);

[NoCoverage] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:252:30
     await fetchWeekData(newWeek);
     
     // Phase 3: Slide in new cards from opposite direction
-    const slideInDirection = direction === 'prev' ? 'in-from-right' : 'in-from-left';
+    const slideInDirection = false ? 'in-from-right' : 'in-from-left';
     console.log('📥 Slide IN direction:', slideInDirection);
     setSlideDirection(slideInDirection);

[NoCoverage] BooleanLiteral
src/pages/Dashboard/Dashboard.jsx:255:22
     const slideInDirection = direction === 'prev' ? 'in-from-right' : 'in-from-left';
     console.log('📥 Slide IN direction:', slideInDirection);
     setSlideDirection(slideInDirection);
-    setIsLoadingWeek(false);
+    setIsLoadingWeek(true);
     
     // Reset after slide-in completes (0.6s animation + 0.4s stagger)

[NoCoverage] BlockStatement
src/pages/Dashboard/Dashboard.jsx:258:22
     setIsLoadingWeek(false);
     
     // Reset after slide-in completes (0.6s animation + 0.4s stagger)
-    setTimeout(() => {
-      console.log('✅ Animation complete, resetting');
-      setSlideDirection(null);
-    }, 1000);
+    setTimeout(() => {}, 1000);
   };
 

[NoCoverage] StringLiteral
src/pages/Dashboard/Dashboard.jsx:259:19
     
     // Reset after slide-in completes (0.6s animation + 0.4s stagger)
     setTimeout(() => {
-      console.log('✅ Animation complete, resetting');
+      console.log("");
       setSlideDirection(null);
     }, 1000);

[NoCoverage] BlockStatement
src/pages/Dashboard/Dashboard.jsx:265:39
   };
 
   // Handle continue session button click
-  const handleContinueSession = () => {
-    if (!isActive) {
-      setError('You have historical access only and cannot access new learning sessions.');
-      return;
-    }
-    
-    const cohortParam = (user?.role === 'staff' || user?.role === 'admin') && cohortFilter
-      ? `?cohort=${encodeURIComponent(cohortFilter)}`
-      : '';
-    
-    navigate(`/learning${cohortParam}`);
-  };
+  const handleContinueSession = () => {};
 
   // Navigate to the specific task in the Learning page

[NoCoverage] BooleanLiteral
src/pages/Dashboard/Dashboard.jsx:266:9
 
   // Handle continue session button click
   const handleContinueSession = () => {
-    if (!isActive) {
+    if (isActive) {
       setError('You have historical access only and cannot access new learning sessions.');
       return;

[NoCoverage] BlockStatement
src/pages/Dashboard/Dashboard.jsx:266:20
 
   // Handle continue session button click
   const handleContinueSession = () => {
-    if (!isActive) {
-      setError('You have historical access only and cannot access new learning sessions.');
-      return;
-    }
+    if (!isActive) {}
     
     const cohortParam = (user?.role === 'staff' || user?.role === 'admin') && cohortFilter

[NoCoverage] EqualityOperator
src/pages/Dashboard/Dashboard.jsx:271:52
       return;
     }
     
-    const cohortParam = (user?.role === 'staff' || user?.role === 'admin') && cohortFilter
+    const cohortParam = (user?.role === 'staff' || user?.role !== 'admin') && cohortFilter
       ? `?cohort=${encodeURIComponent(cohortFilter)}`
       : '';

[NoCoverage] OptionalChaining
src/pages/Dashboard/Dashboard.jsx:271:52
       return;
     }
     
-    const cohortParam = (user?.role === 'staff' || user?.role === 'admin') && cohortFilter
+    const cohortParam = (user?.role === 'staff' || user.role === 'admin') && cohortFilter
       ? `?cohort=${encodeURIComponent(cohortFilter)}`
       : '';

[NoCoverage] BlockStatement
src/pages/Dashboard/Dashboard.jsx:279:38
   };
 
   // Navigate to the specific task in the Learning page
-  const navigateToTask = (taskId) => {
-    if (!isActive) {
-      setError('You have historical access only and cannot access new learning sessions.');
-      return;
-    }
-    
-    const cohortParam = (user?.role === 'staff' || user?.role === 'admin') && cohortFilter
-      ? `&cohort=${encodeURIComponent(cohortFilter)}`
-      : '';
-    
-    navigate(`/learning?taskId=${taskId}${cohortParam}`);
-  };
+  const navigateToTask = (taskId) => {};
 
   // Navigate to calendar for historical viewing

[NoCoverage] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:280:9
 
   // Navigate to the specific task in the Learning page
   const navigateToTask = (taskId) => {
-    if (!isActive) {
+    if (true) {
       setError('You have historical access only and cannot access new learning sessions.');
       return;

[NoCoverage] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:280:9
 
   // Navigate to the specific task in the Learning page
   const navigateToTask = (taskId) => {
-    if (!isActive) {
+    if (false) {
       setError('You have historical access only and cannot access new learning sessions.');
       return;

[NoCoverage] LogicalOperator
src/pages/Dashboard/Dashboard.jsx:285:26
       return;
     }
     
-    const cohortParam = (user?.role === 'staff' || user?.role === 'admin') && cohortFilter
+    const cohortParam = (user?.role === 'staff' && user?.role === 'admin') && cohortFilter
       ? `&cohort=${encodeURIComponent(cohortFilter)}`
       : '';

[NoCoverage] OptionalChaining
src/pages/Dashboard/Dashboard.jsx:285:26
       return;
     }
     
-    const cohortParam = (user?.role === 'staff' || user?.role === 'admin') && cohortFilter
+    const cohortParam = (user.role === 'staff' || user?.role === 'admin') && cohortFilter
       ? `&cohort=${encodeURIComponent(cohortFilter)}`
       : '';

[NoCoverage] StringLiteral
src/pages/Dashboard/Dashboard.jsx:287:9
     
     const cohortParam = (user?.role === 'staff' || user?.role === 'admin') && cohortFilter
       ? `&cohort=${encodeURIComponent(cohortFilter)}`
-      : '';
+      : "Stryker was here!";
     
     navigate(`/learning?taskId=${taskId}${cohortParam}`);

[NoCoverage] BlockStatement
src/pages/Dashboard/Dashboard.jsx:293:36
   };
 
   // Navigate to calendar for historical viewing
-  const navigateToCalendar = () => {
-    navigate('/calendar');
-  };
+  const navigateToCalendar = () => {};
 
   // Add a helper function to format time from 24-hour to 12-hour format

[NoCoverage] StringLiteral
src/pages/Dashboard/Dashboard.jsx:294:14
 
   // Navigate to calendar for historical viewing
   const navigateToCalendar = () => {
-    navigate('/calendar');
+    navigate("");
   };
 

[NoCoverage] BlockStatement
src/pages/Dashboard/Dashboard.jsx:298:38
   };
 
   // Add a helper function to format time from 24-hour to 12-hour format
-  const formatTime = (timeString) => {
-    if (!timeString) return '';
-    
-    const timeParts = timeString.split(':');
-    const hours = parseInt(timeParts[0], 10);
-    const minutes = timeParts[1];
-    
-    const period = hours >= 12 ? 'PM' : 'AM';
-    const formattedHours = hours % 12 || 12;
-    
-    return `${formattedHours}:${minutes} ${period}`;
-  };
+  const formatTime = (timeString) => {};
 
   // Format date for display (e.g., "10.2 SAT" or "TODAY 10.22 MON")

[NoCoverage] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:299:9
 
   // Add a helper function to format time from 24-hour to 12-hour format
   const formatTime = (timeString) => {
-    if (!timeString) return '';
+    if (true) return '';
     
     const timeParts = timeString.split(':');

[NoCoverage] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:299:9
 
   // Add a helper function to format time from 24-hour to 12-hour format
   const formatTime = (timeString) => {
-    if (!timeString) return '';
+    if (false) return '';
     
     const timeParts = timeString.split(':');

[NoCoverage] EqualityOperator
src/pages/Dashboard/Dashboard.jsx:305:20
     const hours = parseInt(timeParts[0], 10);
     const minutes = timeParts[1];
     
-    const period = hours >= 12 ? 'PM' : 'AM';
+    const period = hours > 12 ? 'PM' : 'AM';
     const formattedHours = hours % 12 || 12;
     

[NoCoverage] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:305:20
     const hours = parseInt(timeParts[0], 10);
     const minutes = timeParts[1];
     
-    const period = hours >= 12 ? 'PM' : 'AM';
+    const period = false ? 'PM' : 'AM';
     const formattedHours = hours % 12 || 12;
     

[NoCoverage] ArithmeticOperator
src/pages/Dashboard/Dashboard.jsx:306:28
     const minutes = timeParts[1];
     
     const period = hours >= 12 ? 'PM' : 'AM';
-    const formattedHours = hours % 12 || 12;
+    const formattedHours = hours * 12 || 12;
     
     return `${formattedHours}:${minutes} ${period}`;

[NoCoverage] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:306:28
     const minutes = timeParts[1];
     
     const period = hours >= 12 ? 'PM' : 'AM';
-    const formattedHours = hours % 12 || 12;
+    const formattedHours = true;
     
     return `${formattedHours}:${minutes} ${period}`;

[NoCoverage] BooleanLiteral
src/pages/Dashboard/Dashboard.jsx:312:48
   };
 
   // Format date for display (e.g., "10.2 SAT" or "TODAY 10.22 MON")
-  const formatDayDate = (dateString, isToday = false) => {
+  const formatDayDate = (dateString, isToday = true) => {
     if (!dateString) return { prefix: '', date: '', full: '' };
     // Handle ISO timestamps or simple date strings

[NoCoverage] BlockStatement
src/pages/Dashboard/Dashboard.jsx:312:58
   };
 
   // Format date for display (e.g., "10.2 SAT" or "TODAY 10.22 MON")
-  const formatDayDate = (dateString, isToday = false) => {
-    if (!dateString) return { prefix: '', date: '', full: '' };
-    // Handle ISO timestamps or simple date strings
-    const date = new Date(dateString);
-    const month = date.getMonth() + 1;
-    const day = date.getDate();
-    const dayOfWeek = date.toLocaleDateString('en-US', { weekday: 'short' }).toUpperCase();
-    
-    const dateStr = `${month}.${day} ${dayOfWeek}`;
-    
-    if (isToday) {
-      return {
-        prefix: 'TODAY ',
-        date: dateStr,
-        full: `TODAY ${dateStr}`
-      };
-    }
-    return {
-      prefix: '',
-      date: dateStr,
-      full: dateStr
-    };
-  };
+  const formatDayDate = (dateString, isToday = false) => {};
 
   // Check if a date is today

[NoCoverage] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:313:9
 
   // Format date for display (e.g., "10.2 SAT" or "TODAY 10.22 MON")
   const formatDayDate = (dateString, isToday = false) => {
-    if (!dateString) return { prefix: '', date: '', full: '' };
+    if (true) return { prefix: '', date: '', full: '' };
     // Handle ISO timestamps or simple date strings
     const date = new Date(dateString);

[NoCoverage] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:313:9
 
   // Format date for display (e.g., "10.2 SAT" or "TODAY 10.22 MON")
   const formatDayDate = (dateString, isToday = false) => {
-    if (!dateString) return { prefix: '', date: '', full: '' };
+    if (false) return { prefix: '', date: '', full: '' };
     // Handle ISO timestamps or simple date strings
     const date = new Date(dateString);

[NoCoverage] ArithmeticOperator
src/pages/Dashboard/Dashboard.jsx:316:19
     if (!dateString) return { prefix: '', date: '', full: '' };
     // Handle ISO timestamps or simple date strings
     const date = new Date(dateString);
-    const month = date.getMonth() + 1;
+    const month = date.getMonth() - 1;
     const day = date.getDate();
     const dayOfWeek = date.toLocaleDateString('en-US', { weekday: 'short' }).toUpperCase();

[NoCoverage] MethodExpression
src/pages/Dashboard/Dashboard.jsx:318:23
     const date = new Date(dateString);
     const month = date.getMonth() + 1;
     const day = date.getDate();
-    const dayOfWeek = date.toLocaleDateString('en-US', { weekday: 'short' }).toUpperCase();
+    const dayOfWeek = date.toLocaleDateString('en-US', {
+  weekday: 'short'
+}).toLowerCase();
     
     const dateStr = `${month}.${day} ${dayOfWeek}`;

[NoCoverage] ObjectLiteral
src/pages/Dashboard/Dashboard.jsx:318:56
     const date = new Date(dateString);
     const month = date.getMonth() + 1;
     const day = date.getDate();
-    const dayOfWeek = date.toLocaleDateString('en-US', { weekday: 'short' }).toUpperCase();
+    const dayOfWeek = date.toLocaleDateString('en-US', {}).toUpperCase();
     
     const dateStr = `${month}.${day} ${dayOfWeek}`;

[NoCoverage] StringLiteral
src/pages/Dashboard/Dashboard.jsx:320:21
     const day = date.getDate();
     const dayOfWeek = date.toLocaleDateString('en-US', { weekday: 'short' }).toUpperCase();
     
-    const dateStr = `${month}.${day} ${dayOfWeek}`;
+    const dateStr = ``;
     
     if (isToday) {

[NoCoverage] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:322:9
     
     const dateStr = `${month}.${day} ${dayOfWeek}`;
     
-    if (isToday) {
+    if (false) {
       return {
         prefix: 'TODAY ',

[NoCoverage] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:322:9
     
     const dateStr = `${month}.${day} ${dayOfWeek}`;
     
-    if (isToday) {
+    if (true) {
       return {
         prefix: 'TODAY ',

[NoCoverage] ObjectLiteral
src/pages/Dashboard/Dashboard.jsx:329:12
         full: `TODAY ${dateStr}`
       };
     }
-    return {
-      prefix: '',
-      date: dateStr,
-      full: dateStr
-    };
+    return {};
   };
 

[NoCoverage] BlockStatement
src/pages/Dashboard/Dashboard.jsx:337:39
   };
 
   // Check if a date is today
-  const isDateToday = (dateString) => {
-    if (!dateString) return false;
-    const date = new Date(dateString);
-    const today = new Date();
-    return date.getDate() === today.getDate() &&
-           date.getMonth() === today.getMonth() &&
-           date.getFullYear() === today.getFullYear();
-  };
+  const isDateToday = (dateString) => {};
 
   // Check if date is in the past

[NoCoverage] BooleanLiteral
src/pages/Dashboard/Dashboard.jsx:338:9
 
   // Check if a date is today
   const isDateToday = (dateString) => {
-    if (!dateString) return false;
+    if (dateString) return false;
     const date = new Date(dateString);
     const today = new Date();

[NoCoverage] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:338:9
 
   // Check if a date is today
   const isDateToday = (dateString) => {
-    if (!dateString) return false;
+    if (false) return false;
     const date = new Date(dateString);
     const today = new Date();

[NoCoverage] LogicalOperator
src/pages/Dashboard/Dashboard.jsx:341:12
     if (!dateString) return false;
     const date = new Date(dateString);
     const today = new Date();
-    return date.getDate() === today.getDate() &&
-           date.getMonth() === today.getMonth() &&
-           date.getFullYear() === today.getFullYear();
+    return date.getDate() === today.getDate() && date.getMonth() === today.getMonth() || date.getFullYear() === today.getFullYear();
   };
 

[NoCoverage] LogicalOperator
src/pages/Dashboard/Dashboard.jsx:341:12
     if (!dateString) return false;
     const date = new Date(dateString);
     const today = new Date();
-    return date.getDate() === today.getDate() &&
-           date.getMonth() === today.getMonth() &&
+    return date.getDate() === today.getDate() || date.getMonth() === today.getMonth() &&
            date.getFullYear() === today.getFullYear();
   };

[NoCoverage] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:342:12
     const date = new Date(dateString);
     const today = new Date();
     return date.getDate() === today.getDate() &&
-           date.getMonth() === today.getMonth() &&
+           true &&
            date.getFullYear() === today.getFullYear();
   };

[NoCoverage] EqualityOperator
src/pages/Dashboard/Dashboard.jsx:342:12
     const date = new Date(dateString);
     const today = new Date();
     return date.getDate() === today.getDate() &&
-           date.getMonth() === today.getMonth() &&
+           date.getMonth() !== today.getMonth() &&
            date.getFullYear() === today.getFullYear();
   };

[NoCoverage] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:343:12
     const today = new Date();
     return date.getDate() === today.getDate() &&
            date.getMonth() === today.getMonth() &&
-           date.getFullYear() === today.getFullYear();
+           true;
   };
 

[NoCoverage] EqualityOperator
src/pages/Dashboard/Dashboard.jsx:343:12
     const today = new Date();
     return date.getDate() === today.getDate() &&
            date.getMonth() === today.getMonth() &&
-           date.getFullYear() === today.getFullYear();
+           date.getFullYear() !== today.getFullYear();
   };
 

[NoCoverage] BlockStatement
src/pages/Dashboard/Dashboard.jsx:347:38
   };
 
   // Check if date is in the past
-  const isDatePast = (dateString) => {
-    if (!dateString) return false;
-    const date = new Date(dateString);
-    const today = new Date();
-    today.setHours(0, 0, 0, 0);
-    return date < today;
-  };
+  const isDatePast = (dateString) => {};
 
   // Navigate to volunteer feedback

[NoCoverage] BooleanLiteral
src/pages/Dashboard/Dashboard.jsx:348:9
 
   // Check if date is in the past
   const isDatePast = (dateString) => {
-    if (!dateString) return false;
+    if (dateString) return false;
     const date = new Date(dateString);
     const today = new Date();

[NoCoverage] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:348:9
 
   // Check if date is in the past
   const isDatePast = (dateString) => {
-    if (!dateString) return false;
+    if (true) return false;
     const date = new Date(dateString);
     const today = new Date();

[NoCoverage] EqualityOperator
src/pages/Dashboard/Dashboard.jsx:352:12
     const date = new Date(dateString);
     const today = new Date();
     today.setHours(0, 0, 0, 0);
-    return date < today;
+    return date >= today;
   };
 

[NoCoverage] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:352:12
     const date = new Date(dateString);
     const today = new Date();
     today.setHours(0, 0, 0, 0);
-    return date < today;
+    return true;
   };
 

[NoCoverage] BlockStatement
src/pages/Dashboard/Dashboard.jsx:356:45
   };
 
   // Navigate to volunteer feedback
-  const navigateToVolunteerFeedback = () => {
-    navigate('/volunteer-feedback');
-  };
+  const navigateToVolunteerFeedback = () => {};
 
   // Handle opening missed assignments sidebar

[NoCoverage] BlockStatement
src/pages/Dashboard/Dashboard.jsx:361:46
   };
 
   // Handle opening missed assignments sidebar
-  const handleMissedAssignmentsClick = () => {
-    setIsSidebarOpen(true);
-  };
+  const handleMissedAssignmentsClick = () => {};
 
   // Handle closing sidebar

[NoCoverage] BooleanLiteral
src/pages/Dashboard/Dashboard.jsx:362:22
 
   // Handle opening missed assignments sidebar
   const handleMissedAssignmentsClick = () => {
-    setIsSidebarOpen(true);
+    setIsSidebarOpen(false);
   };
 

[NoCoverage] BlockStatement
src/pages/Dashboard/Dashboard.jsx:366:36
   };
 
   // Handle closing sidebar
-  const handleCloseSidebar = () => {
-    setIsSidebarOpen(false);
-  };
+  const handleCloseSidebar = () => {};
 
   // Handle navigation from sidebar to specific day/task

[NoCoverage] BooleanLiteral
src/pages/Dashboard/Dashboard.jsx:367:22
 
   // Handle closing sidebar
   const handleCloseSidebar = () => {
-    setIsSidebarOpen(false);
+    setIsSidebarOpen(true);
   };
 

[NoCoverage] BlockStatement
src/pages/Dashboard/Dashboard.jsx:371:50
   };
 
   // Handle navigation from sidebar to specific day/task
-  const handleNavigateToDay = (dayId, taskId) => {
-    // Navigate to the day view with the task highlighted
-    navigate(`/calendar?day=${dayId}&task=${taskId}`);
-  };
+  const handleNavigateToDay = (dayId, taskId) => {};
 
   // Render skeleton loading cards
