[Killed] ConditionalExpression
src/components/Layout/Layout.jsx:775:11
             </Link>
           )
         ) : (
-          (user?.role === 'admin' || user?.role === 'staff') && (
-            <Link
-              to="/admin/assessment-grades"
-              className={cn(
-                "relative h-[44px] flex items-center",
-                location.pathname === '/admin/assessment-grades' ? "bg-[#4242EA]" : "hover:bg-white/10"
-              )}
-            >
-              <div className="absolute left-0 top-0 w-[50px] h-[44px] flex items-center justify-center">
-                <Award className="h-4 w-4 text-[#E3E3E3]" />
-              </div>
-              <div
-                className={cn(
-                  "flex items-center transition-all duration-300 ease-in-out",
-                  isNavbarHovered ? "ml-[50px] opacity-100" : "ml-[50px] opacity-0 w-0 overflow-hidden"
-                )}
-              >
-                <span className="text-white text-sm font-medium whitespace-nowrap">Assessment Grades</span>
-              </div>
-            </Link>
-          )
+          true
         )}
 
killedBy: Dashboard - Role-Based Access Control Staff Role should show ALL admin navigation items for staff
statusReason: Unable to find an element with the text: Assessment Grades. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex h-screen w-full bg-background"
    >

[Survived] ConditionalExpression
src/components/Layout/Layout.jsx:780:17
               to="/admin/assessment-grades"
               className={cn(
                 "relative h-[44px] flex items-center",
-                location.pathname === '/admin/assessment-grades' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                true ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >

[Survived] ConditionalExpression
src/components/Layout/Layout.jsx:780:17
               to="/admin/assessment-grades"
               className={cn(
                 "relative h-[44px] flex items-center",
-                location.pathname === '/admin/assessment-grades' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                false ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:800:11
 
         {/* Admissions - Only show for admins and only in expanded mobile navbar */}
         {isMobile ? (
-          (user?.role === 'admin' || user?.role === 'staff') && isMobileNavbarOpen && (
-            <Link
-              to="/admissions-dashboard"
-              onClick={closeMobileNavbar}
-              className={cn(
-                "relative h-[53px] flex items-center",
-                location.pathname === '/admissions-dashboard' ? "bg-[#4242EA]" : "hover:bg-white/10"
-              )}
-            >
-              <div className="absolute left-0 top-0 w-[60px] h-[53px] flex items-center justify-center">
-                <Users className="h-4 w-4 text-[#E3E3E3]" />
-              </div>
-              <div className="flex items-center ml-[60px]">
-                <span className="text-white text-sm font-medium whitespace-nowrap">Admissions</span>
-              </div>
-            </Link>
-          )
+          false
         ) : (
           (user?.role === 'admin' || user?.role === 'staff') && (

[NoCoverage] LogicalOperator
src/components/Layout/Layout.jsx:800:12
 
         {/* Admissions - Only show for admins and only in expanded mobile navbar */}
         {isMobile ? (
-          (user?.role === 'admin' || user?.role === 'staff') && isMobileNavbarOpen && (
+          (user?.role === 'admin' && user?.role === 'staff') && isMobileNavbarOpen && (
             <Link
               to="/admissions-dashboard"

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:806:17
               onClick={closeMobileNavbar}
               className={cn(
                 "relative h-[53px] flex items-center",
-                location.pathname === '/admissions-dashboard' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                false ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >

[NoCoverage] EqualityOperator
src/components/Layout/Layout.jsx:806:17
               onClick={closeMobileNavbar}
               className={cn(
                 "relative h-[53px] flex items-center",
-                location.pathname === '/admissions-dashboard' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                location.pathname !== '/admissions-dashboard' ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >

[Killed] OptionalChaining
src/components/Layout/Layout.jsx:818:12
             </Link>
           )
         ) : (
-          (user?.role === 'admin' || user?.role === 'staff') && (
+          (user.role === 'admin' || user?.role === 'staff') && (
             <Link
               to="/admissions-dashboard"
killedBy: Dashboard - Role-Based Access Control Role Permission Edge Cases should handle null user gracefully
statusReason: Cannot read properties of null (reading 'role')

[Survived] EqualityOperator
src/components/Layout/Layout.jsx:823:17
               to="/admissions-dashboard"
               className={cn(
                 "relative h-[44px] flex items-center",
-                location.pathname === '/admissions-dashboard' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                location.pathname !== '/admissions-dashboard' ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >

[Survived] ConditionalExpression
src/components/Layout/Layout.jsx:823:17
               to="/admissions-dashboard"
               className={cn(
                 "relative h-[44px] flex items-center",
-                location.pathname === '/admissions-dashboard' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                true ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >

[NoCoverage] MethodExpression
src/components/Layout/Layout.jsx:849:54
               onClick={closeMobileNavbar}
               className={cn(
                 "relative h-[53px] flex items-center",
-                (location.pathname === '/content' || location.pathname.startsWith('/content')) ? "bg-[#4242EA]" : "hover:bg-white/10"
+                (location.pathname === '/content' || location.pathname.endsWith('/content')) ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:849:18
               onClick={closeMobileNavbar}
               className={cn(
                 "relative h-[53px] flex items-center",
-                (location.pathname === '/content' || location.pathname.startsWith('/content')) ? "bg-[#4242EA]" : "hover:bg-white/10"
+                (true) ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >

[Killed] EqualityOperator
src/components/Layout/Layout.jsx:861:12
             </Link>
           )
         ) : (
-          (user?.role === 'admin' || user?.role === 'staff') && (
+          (user?.role !== 'admin' || user?.role === 'staff') && (
             <Link
               to="/content"
killedBy: Dashboard - Role-Based Access Control Student/Builder Role should NOT show admin navigation items for students
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <span
  class="text-white text-sm font-medium whitespace-nowrap"
>
  Content Generation
</span> instead

[Survived] MethodExpression
src/components/Layout/Layout.jsx:866:54
               to="/content"
               className={cn(
                 "relative h-[44px] flex items-center",
-                (location.pathname === '/content' || location.pathname.startsWith('/content')) ? "bg-[#4242EA]" : "hover:bg-white/10"
+                (location.pathname === '/content' || location.pathname.endsWith('/content')) ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >

[Survived] LogicalOperator
src/components/Layout/Layout.jsx:866:18
               to="/content"
               className={cn(
                 "relative h-[44px] flex items-center",
-                (location.pathname === '/content' || location.pathname.startsWith('/content')) ? "bg-[#4242EA]" : "hover:bg-white/10"
+                (location.pathname === '/content' && location.pathname.startsWith('/content')) ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:886:11
 
         {/* AI Prompts - Only show for admins and only in expanded mobile navbar */}
         {isMobile ? (
-          (user?.role === 'admin' || user?.role === 'staff') && isMobileNavbarOpen && (
-            <Link
-              to="/admin-prompts"
-              onClick={closeMobileNavbar}
-              className={cn(
-                "relative h-[53px] flex items-center",
-                location.pathname === '/admin-prompts' ? "bg-[#4242EA]" : "hover:bg-white/10"
-              )}
-            >
-              <div className="absolute left-0 top-0 w-[60px] h-[53px] flex items-center justify-center">
-                <Brain className="h-4 w-4 text-[#E3E3E3]" />
-              </div>
-              <div className="flex items-center ml-[60px]">
-                <span className="text-white text-sm font-medium whitespace-nowrap">AI Prompts</span>
-              </div>
-              </Link>
-          )
+          false
         ) : (
           (user?.role === 'admin' || user?.role === 'staff') && (

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:886:12
 
         {/* AI Prompts - Only show for admins and only in expanded mobile navbar */}
         {isMobile ? (
-          (user?.role === 'admin' || user?.role === 'staff') && isMobileNavbarOpen && (
+          (false || user?.role === 'staff') && isMobileNavbarOpen && (
             <Link
               to="/admin-prompts"

[NoCoverage] EqualityOperator
src/components/Layout/Layout.jsx:892:17
               onClick={closeMobileNavbar}
               className={cn(
                 "relative h-[53px] flex items-center",
-                location.pathname === '/admin-prompts' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                location.pathname !== '/admin-prompts' ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:892:17
               onClick={closeMobileNavbar}
               className={cn(
                 "relative h-[53px] flex items-center",
-                location.pathname === '/admin-prompts' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                false ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >

[Killed] ConditionalExpression
src/components/Layout/Layout.jsx:904:11
               </Link>
           )
         ) : (
-          (user?.role === 'admin' || user?.role === 'staff') && (
-            <Link
-              to="/admin-prompts"
-              className={cn(
-                "relative h-[44px] flex items-center",
-                location.pathname === '/admin-prompts' ? "bg-[#4242EA]" : "hover:bg-white/10"
-              )}
-            >
-              <div className="absolute left-0 top-0 w-[50px] h-[44px] flex items-center justify-center">
-                <Brain className="h-4 w-4 text-[#E3E3E3]" />
-              </div>
-              <div
-                className={cn(
-                  "flex items-center transition-all duration-300 ease-in-out",
-                  isNavbarHovered ? "ml-[50px] opacity-100" : "ml-[50px] opacity-0 w-0 overflow-hidden"
-                )}
-              >
-                <span className="text-white text-sm font-medium whitespace-nowrap">AI Prompts</span>
-              </div>
-              </Link>
-          )
+          true
         )}
 
killedBy: Dashboard - Role-Based Access Control Staff Role should show ALL admin navigation items for staff
statusReason: Unable to find an element with the text: AI Prompts. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex h-screen w-full bg-background"
    >

[Survived] EqualityOperator
src/components/Layout/Layout.jsx:909:17
               to="/admin-prompts"
               className={cn(
                 "relative h-[44px] flex items-center",
-                location.pathname === '/admin-prompts' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                location.pathname !== '/admin-prompts' ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >

[Survived] ConditionalExpression
src/components/Layout/Layout.jsx:909:17
               to="/admin-prompts"
               className={cn(
                 "relative h-[44px] flex items-center",
-                location.pathname === '/admin-prompts' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                true ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:929:12
 
         {/* Volunteer Feedback - Show for volunteers and admins and only in expanded mobile navbar */}
         {isMobile ? (
-          (user?.role === 'volunteer' || user?.role === 'admin' || user?.role === 'staff') && isMobileNavbarOpen && (
+          (false || user?.role === 'staff') && isMobileNavbarOpen && (
             <Link
               to={user?.role === 'volunteer' ? '/volunteer-feedback' : '/admin-volunteer-feedback'}

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:929:12
 
         {/* Volunteer Feedback - Show for volunteers and admins and only in expanded mobile navbar */}
         {isMobile ? (
-          (user?.role === 'volunteer' || user?.role === 'admin' || user?.role === 'staff') && isMobileNavbarOpen && (
+          (false || user?.role === 'admin' || user?.role === 'staff') && isMobileNavbarOpen && (
             <Link
               to={user?.role === 'volunteer' ? '/volunteer-feedback' : '/admin-volunteer-feedback'}

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:931:19
         {isMobile ? (
           (user?.role === 'volunteer' || user?.role === 'admin' || user?.role === 'staff') && isMobileNavbarOpen && (
             <Link
-              to={user?.role === 'volunteer' ? '/volunteer-feedback' : '/admin-volunteer-feedback'}
+              to={true ? '/volunteer-feedback' : '/admin-volunteer-feedback'}
               onClick={closeMobileNavbar}
               className={cn(

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:935:18
               onClick={closeMobileNavbar}
               className={cn(
                 "relative h-[53px] flex items-center",
-                (location.pathname === '/volunteer-feedback' || location.pathname === '/admin-volunteer-feedback') ? "bg-[#4242EA]" : "hover:bg-white/10"
+                (true) ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >

[NoCoverage] EqualityOperator
src/components/Layout/Layout.jsx:935:18
               onClick={closeMobileNavbar}
               className={cn(
                 "relative h-[53px] flex items-center",
-                (location.pathname === '/volunteer-feedback' || location.pathname === '/admin-volunteer-feedback') ? "bg-[#4242EA]" : "hover:bg-white/10"
+                (location.pathname !== '/volunteer-feedback' || location.pathname === '/admin-volunteer-feedback') ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >

[Killed] LogicalOperator
src/components/Layout/Layout.jsx:947:12
               </Link>
           )
         ) : (
-          (user?.role === 'volunteer' || user?.role === 'admin' || user?.role === 'staff') && (
+          ((user?.role === 'volunteer' || user?.role === 'admin') && user?.role === 'staff') && (
             <Link
               to={user?.role === 'volunteer' ? '/volunteer-feedback' : '/admin-volunteer-feedback'}
killedBy: Dashboard - Role-Based Access Control Volunteer Role should show Volunteer Feedback link for volunteers
statusReason: Unable to find an element with the text: Volunteer Feedback. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex h-screen w-full bg-background"
    >

[Killed] ConditionalExpression
src/components/Layout/Layout.jsx:947:11
               </Link>
           )
         ) : (
-          (user?.role === 'volunteer' || user?.role === 'admin' || user?.role === 'staff') && (
-            <Link
-              to={user?.role === 'volunteer' ? '/volunteer-feedback' : '/admin-volunteer-feedback'}
-              className={cn(
-                "relative h-[44px] flex items-center",
-                (location.pathname === '/volunteer-feedback' || location.pathname === '/admin-volunteer-feedback') ? "bg-[#4242EA]" : "hover:bg-white/10"
-              )}
-            >
-              <div className="absolute left-0 top-0 w-[50px] h-[44px] flex items-center justify-center">
-                <MessageCircle className="h-4 w-4 text-[#E3E3E3]" />
-              </div>
-              <div
-                className={cn(
-                  "flex items-center transition-all duration-300 ease-in-out",
-                  isNavbarHovered ? "ml-[50px] opacity-100" : "ml-[50px] opacity-0 w-0 overflow-hidden"
-                )}
-              >
-                <span className="text-white text-sm font-medium whitespace-nowrap">Volunteer Feedback</span>
-              </div>
-              </Link>
-          )
+          false
         )}
 
killedBy: Dashboard - Role-Based Access Control Volunteer Role should show Volunteer Feedback link for volunteers
statusReason: Unable to find an element with the text: Volunteer Feedback. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex h-screen w-full bg-background"
    >

[Survived] ConditionalExpression
src/components/Layout/Layout.jsx:952:65
               to={user?.role === 'volunteer' ? '/volunteer-feedback' : '/admin-volunteer-feedback'}
               className={cn(
                 "relative h-[44px] flex items-center",
-                (location.pathname === '/volunteer-feedback' || location.pathname === '/admin-volunteer-feedback') ? "bg-[#4242EA]" : "hover:bg-white/10"
+                (location.pathname === '/volunteer-feedback' || false) ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >

[Survived] ConditionalExpression
src/components/Layout/Layout.jsx:952:18
               to={user?.role === 'volunteer' ? '/volunteer-feedback' : '/admin-volunteer-feedback'}
               className={cn(
                 "relative h-[44px] flex items-center",
-                (location.pathname === '/volunteer-feedback' || location.pathname === '/admin-volunteer-feedback') ? "bg-[#4242EA]" : "hover:bg-white/10"
+                (false) ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:981:17
               onClick={closeMobileNavbar}
               className={cn(
                 "relative h-[53px] flex items-center",
-                location.pathname === '/account' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                true ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >

[NoCoverage] EqualityOperator
src/components/Layout/Layout.jsx:981:17
               onClick={closeMobileNavbar}
               className={cn(
                 "relative h-[53px] flex items-center",
-                location.pathname === '/account' ? "bg-[#4242EA]" : "hover:bg-white/10"
+                location.pathname !== '/account' ? "bg-[#4242EA]" : "hover:bg-white/10"
               )}
             >

[Survived] ConditionalExpression
src/components/Layout/Layout.jsx:1000:15
             to="/account"
             className={cn(
               "relative h-[44px] flex items-center",
-              location.pathname === '/account' ? "bg-[#4242EA]" : "hover:bg-white/10"
+              true ? "bg-[#4242EA]" : "hover:bg-white/10"
             )}
           >

[Survived] ConditionalExpression
src/components/Layout/Layout.jsx:1000:15
             to="/account"
             className={cn(
               "relative h-[44px] flex items-center",
-              location.pathname === '/account' ? "bg-[#4242EA]" : "hover:bg-white/10"
+              false ? "bg-[#4242EA]" : "hover:bg-white/10"
             )}
           >

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:1022:11
 
         {/* Logout - Only show in expanded mobile navbar */}
         {isMobile ? (
-          isMobileNavbarOpen && (
-            <button
-              onClick={handleLogout}
-              className="relative h-[53px] flex items-center hover:bg-white/10 text-[#E3E3E3] w-full"
-            >
-              <div className="absolute left-0 top-0 w-[60px] h-[53px] flex items-center justify-center">
-                <svg width="16" height="16" viewBox="0 0 16 18" fill="none" transform="rotate(90)">
-                  <path d="M6 17L2 13L6 9" stroke="#E3E3E3" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
-                  <path d="M2 13H14" stroke="#E3E3E3" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
-                  <path d="M10 7V5C10 3.93913 9.57857 2.92172 8.82843 2.17157C8.07828 1.42143 7.06087 1 6 1H4" stroke="#E3E3E3" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
-                </svg>
-              </div>
-              <div className="flex items-center ml-[60px]">
-                <span className="text-white text-sm font-medium whitespace-nowrap">Logout</span>
-              </div>
-            </button>
-          )
+          true
         ) : (
           <button

[NoCoverage] ConditionalExpression
src/components/Layout/Layout.jsx:1022:11
 
         {/* Logout - Only show in expanded mobile navbar */}
         {isMobile ? (
-          isMobileNavbarOpen && (
-            <button
-              onClick={handleLogout}
-              className="relative h-[53px] flex items-center hover:bg-white/10 text-[#E3E3E3] w-full"
-            >
-              <div className="absolute left-0 top-0 w-[60px] h-[53px] flex items-center justify-center">
-                <svg width="16" height="16" viewBox="0 0 16 18" fill="none" transform="rotate(90)">
-                  <path d="M6 17L2 13L6 9" stroke="#E3E3E3" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
-                  <path d="M2 13H14" stroke="#E3E3E3" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
-                  <path d="M10 7V5C10 3.93913 9.57857 2.92172 8.82843 2.17157C8.07828 1.42143 7.06087 1 6 1H4" stroke="#E3E3E3" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
-                </svg>
-              </div>
-              <div className="flex items-center ml-[60px]">
-                <span className="text-white text-sm font-medium whitespace-nowrap">Logout</span>
-              </div>
-            </button>
-          )
+          false
         ) : (
           <button

[NoCoverage] StringLiteral
src/components/Layout/Layout.jsx:1066:20
       {/* Main Content - Desktop: 50px left margin for collapsed navbar, Mobile: no margin */}
       <main className={cn(
         "flex-1 overflow-auto bg-[#EFEFEF]",
-        isMobile ? "ml-0" : "ml-[50px]"
+        isMobile ? "" : "ml-[50px]"
       )}>
         {/* Mobile Header Bar - Only show on mobile */}

[Survived] LogicalOperator
src/components/Layout/Layout.jsx:1069:10
         isMobile ? "ml-0" : "ml-[50px]"
       )}>
         {/* Mobile Header Bar - Only show on mobile */}
-        {isMobile && (
-          <div className="sticky top-0 z-50 bg-[#E751E7] h-[53px] flex items-center justify-end px-4">
-            <div className="flex items-center gap-2 text-sm">
-              <div className="flex items-center gap-2">
-                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" className="text-white">
-                  <circle cx="12" cy="12" r="10" stroke="currentColor" strokeWidth="2"/>
-                  <path d="M8 15C8 15 9.5 13 12 13C14.5 13 16 15 16 15" stroke="currentColor" strokeWidth="2" strokeLinecap="round"/>
-                  <circle cx="9" cy="9" r="1" fill="currentColor"/>
-                  <circle cx="15" cy="9" r="1" fill="currentColor"/>
-                </svg>
-                <span className="text-white font-medium">( 3 ) missed assignments</span>
-              </div>
-            </div>
-          </div>
-        )}
+        {isMobile || <div className="sticky top-0 z-50 bg-[#E751E7] h-[53px] flex items-center justify-end px-4">
+            <div className="flex items-center gap-2 text-sm">
+              <div className="flex items-center gap-2">
+                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" className="text-white">
+                  <circle cx="12" cy="12" r="10" stroke="currentColor" strokeWidth="2" />
+                  <path d="M8 15C8 15 9.5 13 12 13C14.5 13 16 15 16 15" stroke="currentColor" strokeWidth="2" strokeLinecap="round" />
+                  <circle cx="9" cy="9" r="1" fill="currentColor" />
+                  <circle cx="15" cy="9" r="1" fill="currentColor" />
+                </svg>
+                <span className="text-white font-medium">( 3 ) missed assignments</span>
+              </div>
+            </div>
+          </div>}
         
         {/* Page Content */}

[Survived] ConditionalExpression
src/components/Layout/Layout.jsx:1069:10
         isMobile ? "ml-0" : "ml-[50px]"
       )}>
         {/* Mobile Header Bar - Only show on mobile */}
-        {isMobile && (
-          <div className="sticky top-0 z-50 bg-[#E751E7] h-[53px] flex items-center justify-end px-4">
-            <div className="flex items-center gap-2 text-sm">
-              <div className="flex items-center gap-2">
-                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" className="text-white">
-                  <circle cx="12" cy="12" r="10" stroke="currentColor" strokeWidth="2"/>
-                  <path d="M8 15C8 15 9.5 13 12 13C14.5 13 16 15 16 15" stroke="currentColor" strokeWidth="2" strokeLinecap="round"/>
-                  <circle cx="9" cy="9" r="1" fill="currentColor"/>
-                  <circle cx="15" cy="9" r="1" fill="currentColor"/>
-                </svg>
-                <span className="text-white font-medium">( 3 ) missed assignments</span>
-              </div>
-            </div>
-          </div>
-        )}
+        {true}
         
         {/* Page Content */}
