[NoCoverage] BlockStatement
src/pages/Dashboard/Dashboard.jsx:377:37
   };
 
   // Render skeleton loading cards
-  const renderSkeletonCards = () => {
-    return Array(5).fill(0).map((_, index) => (
-      <div key={`skeleton-${index}`} className="dashboard__day-card dashboard__day-card--skeleton">
-        <div className="skeleton-line skeleton-date"></div>
-        <div className="skeleton-divider"></div>
-        <div className="skeleton-section">
-          <div className="skeleton-line skeleton-title"></div>
-          <div className="skeleton-line"></div>
-          <div className="skeleton-line"></div>
-          <div className="skeleton-line skeleton-short"></div>
-        </div>
-        <div className="skeleton-section">
-          <div className="skeleton-line skeleton-title"></div>
-          <div className="skeleton-line"></div>
-        </div>
-      </div>
-    ));
-  };
+  const renderSkeletonCards = () => {};
 
   // Render historical access view

[NoCoverage] ArrowFunction
src/pages/Dashboard/Dashboard.jsx:378:33
 
   // Render skeleton loading cards
   const renderSkeletonCards = () => {
-    return Array(5).fill(0).map((_, index) => (
-      <div key={`skeleton-${index}`} className="dashboard__day-card dashboard__day-card--skeleton">
-        <div className="skeleton-line skeleton-date"></div>
-        <div className="skeleton-divider"></div>
-        <div className="skeleton-section">
-          <div className="skeleton-line skeleton-title"></div>
-          <div className="skeleton-line"></div>
-          <div className="skeleton-line"></div>
-          <div className="skeleton-line skeleton-short"></div>
-        </div>
-        <div className="skeleton-section">
-          <div className="skeleton-line skeleton-title"></div>
-          <div className="skeleton-line"></div>
-        </div>
-      </div>
-    ));
+    return Array(5).fill(0).map(() => undefined);
   };
 

[Survived] BlockStatement
src/pages/Dashboard/Dashboard.jsx:397:38
   };
 
   // Render historical access view
-  const renderHistoricalView = () => {
-    return (
-      <div className="flex items-center justify-center min-h-screen p-8">
-        <Card className="w-full max-w-2xl">
-          <CardHeader className="text-center">
-            <div className="flex justify-center mb-4">
-              <AlertTriangle className="h-8 w-8 text-primary" />
-            </div>
-            <CardTitle>Historical Access Only</CardTitle>
-            <CardDescription>
-              You have historical access only. You can view your past activities but cannot 
-              participate in new sessions. Please visit the calendar to access your completed work.
-            </CardDescription>
-          </CardHeader>
-          <CardContent className="text-center">
-            <Button onClick={navigateToCalendar}>
-              <Calendar className="h-4 w-4 mr-2" />
-              View Past Sessions
-            </Button>
-          </CardContent>
-        </Card>
-      </div>
-    );
-  };
+  const renderHistoricalView = () => {};
 
   // Render volunteer dashboard view

[Survived] BlockStatement
src/pages/Dashboard/Dashboard.jsx:423:37
   };
 
   // Render volunteer dashboard view
-  const renderVolunteerView = () => {
-    return (
-      <div className="flex items-center justify-center min-h-screen p-8">
-        <Card className="w-full max-w-2xl">
-          <CardHeader className="text-center">
-            <CardTitle className="text-2xl">Welcome, Volunteer!</CardTitle>
-            <CardDescription>
-              Thank you for volunteering with us. You can provide feedback on learner sessions below.
-            </CardDescription>
-          </CardHeader>
-          <CardContent className="text-center">
-            <Button onClick={navigateToVolunteerFeedback}>
-              <BookOpen className="h-4 w-4 mr-2" />
-              Go to Volunteer Feedback
-            </Button>
-          </CardContent>
-        </Card>
-      </div>
-    );
-  };
+  const renderVolunteerView = () => {};
 
   // Mock data for the Figma wireframe

[Survived] ArrayDeclaration
src/pages/Dashboard/Dashboard.jsx:445:26
   };
 
   // Mock data for the Figma wireframe
-  const upcomingEvents = [
-    {
-      date: "10.15.25",
-      title: "Demo Day",
-      time: "8:30PM - 11:00 PM",
-      location: "Blackrock"
-    },
-    {
-      date: "10.25.25", 
-      title: "Fireside Chat with David Yang",
-      time: "2:30PM - 4:00 PM",
-      location: "Pursuit HQ"
-    },
-    {
-      date: "10.26.25",
-      title: "Presentation", 
-      time: "8:30PM - 11:00 PM",
-      location: ""
-    }
-  ];
+  const upcomingEvents = [];
 
   // Render regular dashboard content matching the Figma wireframe

[Survived] StringLiteral
src/pages/Dashboard/Dashboard.jsx:449:13
     {
       date: "10.15.25",
       title: "Demo Day",
-      time: "8:30PM - 11:00 PM",
+      time: "",
       location: "Blackrock"
     },

[Survived] StringLiteral
src/pages/Dashboard/Dashboard.jsx:450:17
       date: "10.15.25",
       title: "Demo Day",
       time: "8:30PM - 11:00 PM",
-      location: "Blackrock"
+      location: ""
     },
     {

[Survived] StringLiteral
src/pages/Dashboard/Dashboard.jsx:453:13
       location: "Blackrock"
     },
     {
-      date: "10.25.25", 
+      date: "", 
       title: "Fireside Chat with David Yang",
       time: "2:30PM - 4:00 PM",

[Survived] StringLiteral
src/pages/Dashboard/Dashboard.jsx:460:14
     },
     {
       date: "10.26.25",
-      title: "Presentation", 
+      title: "", 
       time: "8:30PM - 11:00 PM",
       location: ""

[Killed] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:475:20
           {/* Greeting Section */}
           <div className="dashboard__greeting">
             <h1 className="dashboard__greeting-text">
-              Hey {user?.firstName || 'there'}. Good to see you!
+              Hey {true}. Good to see you!
             </h1>
             <button
killedBy: Dashboard - Role-Based Access Control Student/Builder Role should render dashboard content for active students
statusReason: Unable to find an element with the text: /Hey John. Good to see you!/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="dashboard"
    >

[Killed] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:475:20
           {/* Greeting Section */}
           <div className="dashboard__greeting">
             <h1 className="dashboard__greeting-text">
-              Hey {user?.firstName || 'there'}. Good to see you!
+              Hey {false}. Good to see you!
             </h1>
             <button
killedBy: Dashboard - Role-Based Access Control Student/Builder Role should render dashboard content for active students
statusReason: Unable to find an element with the text: /Hey John. Good to see you!/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="dashboard"
    >

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:478:59
               Hey {user?.firstName || 'there'}. Good to see you!
             </h1>
             <button
-              className={`dashboard__missed-assignments ${missedAssignmentsCount > 0 ? 'dashboard__missed-assignments--active' : ''}`}
+              className={`dashboard__missed-assignments ${true ? 'dashboard__missed-assignments--active' : ''}`}
               onClick={handleMissedAssignmentsClick}
             >

[Survived] EqualityOperator
src/pages/Dashboard/Dashboard.jsx:478:59
               Hey {user?.firstName || 'there'}. Good to see you!
             </h1>
             <button
-              className={`dashboard__missed-assignments ${missedAssignmentsCount > 0 ? 'dashboard__missed-assignments--active' : ''}`}
+              className={`dashboard__missed-assignments ${missedAssignmentsCount <= 0 ? 'dashboard__missed-assignments--active' : ''}`}
               onClick={handleMissedAssignmentsClick}
             >

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:492:18
             <div className="dashboard__todays-goal">
               <h2 className="dashboard__section-title">Today's Goal</h2>
               <p className="dashboard__goal-text">
-                {currentDay?.daily_goal || 'No goal set for today'}
+                {true}
               </p>
               <button className="dashboard__start-btn" onClick={handleContinueSession}>Start</button>

[Survived] LogicalOperator
src/pages/Dashboard/Dashboard.jsx:492:18
             <div className="dashboard__todays-goal">
               <h2 className="dashboard__section-title">Today's Goal</h2>
               <p className="dashboard__goal-text">
-                {currentDay?.daily_goal || 'No goal set for today'}
+                {currentDay?.daily_goal && 'No goal set for today'}
               </p>
               <button className="dashboard__start-btn" onClick={handleContinueSession}>Start</button>

[Survived] ArrowFunction
src/pages/Dashboard/Dashboard.jsx:504:37
             <div className="dashboard__upcoming">
               <h2 className="dashboard__section-title">Upcoming</h2>
               <div className="dashboard__upcoming-list">
-                {upcomingEvents.map((event, index) => (
-                  <div key={index} className="dashboard__upcoming-item">
-                    <div className="dashboard__upcoming-content">
-                      <span className="dashboard__upcoming-date">{event.date}</span>
-                      <div className="dashboard__upcoming-details">
-                        <p className="dashboard__upcoming-title">{event.title}</p>
-                        <p className="dashboard__upcoming-time">{event.time}</p>
-                        {event.location && <p className="dashboard__upcoming-location">{event.location}</p>}
-                      </div>
-                    </div>
-                    <button className="dashboard__signup-btn">Sign up</button>
-                  </div>
-                ))}
+                {upcomingEvents.map(() => undefined)}
               </div>
             </div>

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:511:26
                       <div className="dashboard__upcoming-details">
                         <p className="dashboard__upcoming-title">{event.title}</p>
                         <p className="dashboard__upcoming-time">{event.time}</p>
-                        {event.location && <p className="dashboard__upcoming-location">{event.location}</p>}
+                        {true}
                       </div>
                     </div>

[Survived] LogicalOperator
src/pages/Dashboard/Dashboard.jsx:511:26
                       <div className="dashboard__upcoming-details">
                         <p className="dashboard__upcoming-title">{event.title}</p>
                         <p className="dashboard__upcoming-time">{event.time}</p>
-                        {event.location && <p className="dashboard__upcoming-location">{event.location}</p>}
+                        {event.location || <p className="dashboard__upcoming-location">{event.location}</p>}
                       </div>
                     </div>

[Survived] EqualityOperator
src/pages/Dashboard/Dashboard.jsx:532:19
               </span>
               <span 
                 className={`dashboard__week-subtitle ${
-                  slideDirection === 'out-left' ? 'animate__animated animate__fadeOutLeft' :
+                  slideDirection !== 'out-left' ? 'animate__animated animate__fadeOutLeft' :
                   slideDirection === 'out-right' ? 'animate__animated animate__fadeOutRight' :
                   slideDirection === 'in-from-left' ? 'animate__animated animate__fadeInLeft' :

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:532:19
               </span>
               <span 
                 className={`dashboard__week-subtitle ${
-                  slideDirection === 'out-left' ? 'animate__animated animate__fadeOutLeft' :
+                  true ? 'animate__animated animate__fadeOutLeft' :
                   slideDirection === 'out-right' ? 'animate__animated animate__fadeOutRight' :
                   slideDirection === 'in-from-left' ? 'animate__animated animate__fadeInLeft' :

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:533:19
               <span 
                 className={`dashboard__week-subtitle ${
                   slideDirection === 'out-left' ? 'animate__animated animate__fadeOutLeft' :
-                  slideDirection === 'out-right' ? 'animate__animated animate__fadeOutRight' :
+                  true ? 'animate__animated animate__fadeOutRight' :
                   slideDirection === 'in-from-left' ? 'animate__animated animate__fadeInLeft' :
                   slideDirection === 'in-from-right' ? 'animate__animated animate__fadeInRight' : ''

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:533:19
               <span 
                 className={`dashboard__week-subtitle ${
                   slideDirection === 'out-left' ? 'animate__animated animate__fadeOutLeft' :
-                  slideDirection === 'out-right' ? 'animate__animated animate__fadeOutRight' :
+                  false ? 'animate__animated animate__fadeOutRight' :
                   slideDirection === 'in-from-left' ? 'animate__animated animate__fadeInLeft' :
                   slideDirection === 'in-from-right' ? 'animate__animated animate__fadeInRight' : ''

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:534:19
                 className={`dashboard__week-subtitle ${
                   slideDirection === 'out-left' ? 'animate__animated animate__fadeOutLeft' :
                   slideDirection === 'out-right' ? 'animate__animated animate__fadeOutRight' :
-                  slideDirection === 'in-from-left' ? 'animate__animated animate__fadeInLeft' :
+                  true ? 'animate__animated animate__fadeInLeft' :
                   slideDirection === 'in-from-right' ? 'animate__animated animate__fadeInRight' : ''
                 }`}

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:534:19
                 className={`dashboard__week-subtitle ${
                   slideDirection === 'out-left' ? 'animate__animated animate__fadeOutLeft' :
                   slideDirection === 'out-right' ? 'animate__animated animate__fadeOutRight' :
-                  slideDirection === 'in-from-left' ? 'animate__animated animate__fadeInLeft' :
+                  false ? 'animate__animated animate__fadeInLeft' :
                   slideDirection === 'in-from-right' ? 'animate__animated animate__fadeInRight' : ''
                 }`}

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:535:19
                   slideDirection === 'out-left' ? 'animate__animated animate__fadeOutLeft' :
                   slideDirection === 'out-right' ? 'animate__animated animate__fadeOutRight' :
                   slideDirection === 'in-from-left' ? 'animate__animated animate__fadeInLeft' :
-                  slideDirection === 'in-from-right' ? 'animate__animated animate__fadeInRight' : ''
+                  false ? 'animate__animated animate__fadeInRight' : ''
                 }`}
                 style={{ animationDuration: '0.6s' }}

[Survived] EqualityOperator
src/pages/Dashboard/Dashboard.jsx:535:19
                   slideDirection === 'out-left' ? 'animate__animated animate__fadeOutLeft' :
                   slideDirection === 'out-right' ? 'animate__animated animate__fadeOutRight' :
                   slideDirection === 'in-from-left' ? 'animate__animated animate__fadeInLeft' :
-                  slideDirection === 'in-from-right' ? 'animate__animated animate__fadeInRight' : ''
+                  slideDirection !== 'in-from-right' ? 'animate__animated animate__fadeInRight' : ''
                 }`}
                 style={{ animationDuration: '0.6s' }}

[Survived] ObjectLiteral
src/pages/Dashboard/Dashboard.jsx:537:24
                   slideDirection === 'in-from-left' ? 'animate__animated animate__fadeInLeft' :
                   slideDirection === 'in-from-right' ? 'animate__animated animate__fadeInRight' : ''
                 }`}
-                style={{ animationDuration: '0.6s' }}
+                style={{}}
               >
                 {weeklyGoal}

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:547:51
               <RippleButton
                 variant="outline"
                 size="icon"
-                className={`dashboard__date-btn ${currentWeek > 1 ? 'dashboard__date-btn--active' : ''} ${currentWeek <= 1 ? '!opacity-100' : ''}`}
+                className={`dashboard__date-btn ${true ? 'dashboard__date-btn--active' : ''} ${currentWeek <= 1 ? '!opacity-100' : ''}`}
                 style={{ 
                   backgroundColor: 'var(--color-background)',

[Survived] EqualityOperator
src/pages/Dashboard/Dashboard.jsx:547:51
               <RippleButton
                 variant="outline"
                 size="icon"
-                className={`dashboard__date-btn ${currentWeek > 1 ? 'dashboard__date-btn--active' : ''} ${currentWeek <= 1 ? '!opacity-100' : ''}`}
+                className={`dashboard__date-btn ${currentWeek <= 1 ? 'dashboard__date-btn--active' : ''} ${currentWeek <= 1 ? '!opacity-100' : ''}`}
                 style={{ 
                   backgroundColor: 'var(--color-background)',

[Survived] StringLiteral
src/pages/Dashboard/Dashboard.jsx:549:36
                 size="icon"
                 className={`dashboard__date-btn ${currentWeek > 1 ? 'dashboard__date-btn--active' : ''} ${currentWeek <= 1 ? '!opacity-100' : ''}`}
                 style={{ 
-                  backgroundColor: 'var(--color-background)',
+                  backgroundColor: "",
                   borderColor: currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)', 
                   color: currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)',

[Survived] EqualityOperator
src/pages/Dashboard/Dashboard.jsx:550:32
                 className={`dashboard__date-btn ${currentWeek > 1 ? 'dashboard__date-btn--active' : ''} ${currentWeek <= 1 ? '!opacity-100' : ''}`}
                 style={{ 
                   backgroundColor: 'var(--color-background)',
-                  borderColor: currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)', 
+                  borderColor: currentWeek >= 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)', 
                   color: currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)',
                   '--ripple-button-ripple-color': currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:550:32
                 className={`dashboard__date-btn ${currentWeek > 1 ? 'dashboard__date-btn--active' : ''} ${currentWeek <= 1 ? '!opacity-100' : ''}`}
                 style={{ 
                   backgroundColor: 'var(--color-background)',
-                  borderColor: currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)', 
+                  borderColor: false ? 'var(--color-pursuit-purple)' : 'var(--color-divider)', 
                   color: currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)',
                   '--ripple-button-ripple-color': currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:551:26
                 style={{ 
                   backgroundColor: 'var(--color-background)',
                   borderColor: currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)', 
-                  color: currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)',
+                  color: true ? 'var(--color-pursuit-purple)' : 'var(--color-divider)',
                   '--ripple-button-ripple-color': currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'
                 }}

[Survived] EqualityOperator
src/pages/Dashboard/Dashboard.jsx:551:26
                 style={{ 
                   backgroundColor: 'var(--color-background)',
                   borderColor: currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)', 
-                  color: currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)',
+                  color: currentWeek <= 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)',
                   '--ripple-button-ripple-color': currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'
                 }}

[Survived] EqualityOperator
src/pages/Dashboard/Dashboard.jsx:552:51
                   backgroundColor: 'var(--color-background)',
                   borderColor: currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)', 
                   color: currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)',
-                  '--ripple-button-ripple-color': currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'
+                  '--ripple-button-ripple-color': currentWeek >= 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'
                 }}
                 onClick={() => navigateToWeek('prev')}

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:552:51
                   backgroundColor: 'var(--color-background)',
                   borderColor: currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)', 
                   color: currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)',
-                  '--ripple-button-ripple-color': currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'
+                  '--ripple-button-ripple-color': true ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'
                 }}
                 onClick={() => navigateToWeek('prev')}

[Survived] ArrowFunction
src/pages/Dashboard/Dashboard.jsx:554:26
                   color: currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)',
                   '--ripple-button-ripple-color': currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'
                 }}
-                onClick={() => navigateToWeek('prev')}
+                onClick={() => undefined}
                 disabled={currentWeek <= 1 || isLoadingWeek || slideDirection !== null}
               >

[Survived] LogicalOperator
src/pages/Dashboard/Dashboard.jsx:555:27
                   '--ripple-button-ripple-color': currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'
                 }}
                 onClick={() => navigateToWeek('prev')}
-                disabled={currentWeek <= 1 || isLoadingWeek || slideDirection !== null}
+                disabled={(currentWeek <= 1 || isLoadingWeek) && slideDirection !== null}
               >
                 <ChevronLeft className="w-4 h-4" />

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:555:27
                   '--ripple-button-ripple-color': currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'
                 }}
                 onClick={() => navigateToWeek('prev')}
-                disabled={currentWeek <= 1 || isLoadingWeek || slideDirection !== null}
+                disabled={false}
               >
                 <ChevronLeft className="w-4 h-4" />

[Survived] EqualityOperator
src/pages/Dashboard/Dashboard.jsx:566:53
                 style={{ 
                   backgroundColor: 'var(--color-background)',
-                  borderColor: (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)', 
+                  borderColor: (currentDay?.week && currentWeek <= currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)', 
                   color: (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)',
                   '--ripple-button-ripple-color': (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:566:33
                 style={{ 
                   backgroundColor: 'var(--color-background)',
-                  borderColor: (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)', 
+                  borderColor: (false) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)', 
                   color: (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)',
                   '--ripple-button-ripple-color': (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'

[Survived] EqualityOperator
src/pages/Dashboard/Dashboard.jsx:567:47
                 style={{ 
                   backgroundColor: 'var(--color-background)',
                   borderColor: (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)', 
-                  color: (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)',
+                  color: (currentDay?.week && currentWeek >= currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)',
                   '--ripple-button-ripple-color': (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'
                 }}

[Survived] EqualityOperator
src/pages/Dashboard/Dashboard.jsx:567:47
                 style={{ 
                   backgroundColor: 'var(--color-background)',
                   borderColor: (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)', 
-                  color: (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)',
+                  color: (currentDay?.week && currentWeek <= currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)',
                   '--ripple-button-ripple-color': (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'
                 }}

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:568:52
                   backgroundColor: 'var(--color-background)',
                   borderColor: (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)', 
                   color: (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)',
-                  '--ripple-button-ripple-color': (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'
+                  '--ripple-button-ripple-color': (false) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'
                 }}
                 onClick={() => navigateToWeek('next')}

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:568:72
                   backgroundColor: 'var(--color-background)',
                   borderColor: (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)', 
                   color: (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)',
-                  '--ripple-button-ripple-color': (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'
+                  '--ripple-button-ripple-color': (currentDay?.week && true) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'
                 }}
                 onClick={() => navigateToWeek('next')}

[Survived] ArrowFunction
src/pages/Dashboard/Dashboard.jsx:570:26
                   color: (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)',
                   '--ripple-button-ripple-color': (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'
                 }}
-                onClick={() => navigateToWeek('next')}
+                onClick={() => undefined}
                 disabled={!currentDay?.week || currentWeek >= currentDay.week || isLoadingWeek || slideDirection !== null}
               >

[NoCoverage] StringLiteral
src/pages/Dashboard/Dashboard.jsx:570:47
                   color: (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)',
                   '--ripple-button-ripple-color': (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'
                 }}
-                onClick={() => navigateToWeek('next')}
+                onClick={() => navigateToWeek("")}
                 disabled={!currentDay?.week || currentWeek >= currentDay.week || isLoadingWeek || slideDirection !== null}
               >
