[NoCoverage] StringLiteral
src/pages/Dashboard/Dashboard.jsx:670:57
                                   {isDeliverable && (
                                     <button 
                                       className={`dashboard__deliverable-link ${
-                                        hasSubmission ? 'dashboard__deliverable-link--submitted' : 'dashboard__deliverable-link--pending'
+                                        hasSubmission ? "" : 'dashboard__deliverable-link--pending'
                                       }`}
                                       onClick={() => navigate(`/learning?date=${day.day_date}&taskId=${task.id}`)}

[NoCoverage] ArrowFunction
src/pages/Dashboard/Dashboard.jsx:672:48
                                       className={`dashboard__deliverable-link ${
                                         hasSubmission ? 'dashboard__deliverable-link--submitted' : 'dashboard__deliverable-link--pending'
                                       }`}
-                                      onClick={() => navigate(`/learning?date=${day.day_date}&taskId=${task.id}`)}
+                                      onClick={() => undefined}
                                     >
                                       Submit {task.deliverable_type}

[NoCoverage] StringLiteral
src/pages/Dashboard/Dashboard.jsx:672:63
                                       className={`dashboard__deliverable-link ${
                                         hasSubmission ? 'dashboard__deliverable-link--submitted' : 'dashboard__deliverable-link--pending'
                                       }`}
-                                      onClick={() => navigate(`/learning?date=${day.day_date}&taskId=${task.id}`)}
+                                      onClick={() => navigate(``)}
                                     >
                                       Submit {task.deliverable_type}

[NoCoverage] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:679:32
                                   )}
                                 </div>
                               </div>
-                              {taskIndex < day.tasks.length - 1 && (
-                                <div className="dashboard__activity-divider" />
-                              )}
+                              {true}
                             </div>
                           );

[NoCoverage] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:679:32
                                   )}
                                 </div>
                               </div>
-                              {taskIndex < day.tasks.length - 1 && (
+                              {true && (
                                 <div className="dashboard__activity-divider" />
                               )}

[NoCoverage] LogicalOperator
src/pages/Dashboard/Dashboard.jsx:690:20
             )}
 
                   {/* Go Button */}
-                  {dayIsToday && (
-                    <button 
-                      className="dashboard__go-btn dashboard__go-btn--today"
-                      onClick={handleContinueSession}
-                    >
-                      Go
-                    </button>
-                  )}
+                  {dayIsToday || <button className="dashboard__go-btn dashboard__go-btn--today" onClick={handleContinueSession}>
+                      Go
+                    </button>}
                   {!dayIsToday && showCheckbox && (
                     <button 

[NoCoverage] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:690:20
             )}
 
                   {/* Go Button */}
-                  {dayIsToday && (
-                    <button 
-                      className="dashboard__go-btn dashboard__go-btn--today"
-                      onClick={handleContinueSession}
-                    >
-                      Go
-                    </button>
-                  )}
+                  {false}
                   {!dayIsToday && showCheckbox && (
                     <button 

[NoCoverage] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:698:20
                       Go
                     </button>
                   )}
-                  {!dayIsToday && showCheckbox && (
-                    <button 
-                      className="dashboard__go-btn"
-                      onClick={handleContinueSession}
-                    >
-                      Go
-                    </button>
-                  )}
+                  {true}
                 </div>
               );

[NoCoverage] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:698:20
                       Go
                     </button>
                   )}
-                  {!dayIsToday && showCheckbox && (
+                  {true && (
                     <button 
                       className="dashboard__go-btn"

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:724:16
           <div className="dashboard__mobile-goal">
             <h2 className="dashboard__mobile-section-title">Today's Goal</h2>
             <p className="dashboard__mobile-goal-text">
-              {currentDay?.daily_goal || 'No goal set for today'}
+              {true}
             </p>
           </div>

[Survived] OptionalChaining
src/pages/Dashboard/Dashboard.jsx:724:16
           <div className="dashboard__mobile-goal">
             <h2 className="dashboard__mobile-section-title">Today's Goal</h2>
             <p className="dashboard__mobile-goal-text">
-              {currentDay?.daily_goal || 'No goal set for today'}
+              {currentDay.daily_goal || 'No goal set for today'}
             </p>
           </div>

[Survived] EqualityOperator
src/pages/Dashboard/Dashboard.jsx:745:119
             <RippleButton
               variant="outline"
               size="icon"
-              className={`dashboard__mobile-date-btn ${currentWeek > 1 ? 'dashboard__mobile-date-btn--active' : ''} ${currentWeek <= 1 ? '!opacity-100' : ''}`}
+              className={`dashboard__mobile-date-btn ${currentWeek > 1 ? 'dashboard__mobile-date-btn--active' : ''} ${currentWeek < 1 ? '!opacity-100' : ''}`}
               style={{ 
                 backgroundColor: 'var(--color-background)',

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:745:119
             <RippleButton
               variant="outline"
               size="icon"
-              className={`dashboard__mobile-date-btn ${currentWeek > 1 ? 'dashboard__mobile-date-btn--active' : ''} ${currentWeek <= 1 ? '!opacity-100' : ''}`}
+              className={`dashboard__mobile-date-btn ${currentWeek > 1 ? 'dashboard__mobile-date-btn--active' : ''} ${false ? '!opacity-100' : ''}`}
               style={{ 
                 backgroundColor: 'var(--color-background)',

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:748:30
               className={`dashboard__mobile-date-btn ${currentWeek > 1 ? 'dashboard__mobile-date-btn--active' : ''} ${currentWeek <= 1 ? '!opacity-100' : ''}`}
               style={{ 
                 backgroundColor: 'var(--color-background)',
-                borderColor: currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)', 
+                borderColor: true ? 'var(--color-pursuit-purple)' : 'var(--color-divider)', 
                 color: currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)',
                 '--ripple-button-ripple-color': currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:749:24
               style={{ 
                 backgroundColor: 'var(--color-background)',
                 borderColor: currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)', 
-                color: currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)',
+                color: false ? 'var(--color-pursuit-purple)' : 'var(--color-divider)',
                 '--ripple-button-ripple-color': currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'
               }}

[Survived] EqualityOperator
src/pages/Dashboard/Dashboard.jsx:750:49
                 backgroundColor: 'var(--color-background)',
                 borderColor: currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)', 
                 color: currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)',
-                '--ripple-button-ripple-color': currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'
+                '--ripple-button-ripple-color': currentWeek <= 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'
               }}
               onClick={() => navigateToWeek('prev')}

[NoCoverage] StringLiteral
src/pages/Dashboard/Dashboard.jsx:752:45
                 color: currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)',
                 '--ripple-button-ripple-color': currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'
               }}
-              onClick={() => navigateToWeek('prev')}
+              onClick={() => navigateToWeek("")}
               disabled={currentWeek <= 1 || isLoadingWeek || slideDirection !== null}
             >

[Survived] LogicalOperator
src/pages/Dashboard/Dashboard.jsx:753:25
                 '--ripple-button-ripple-color': currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'
               }}
               onClick={() => navigateToWeek('prev')}
-              disabled={currentWeek <= 1 || isLoadingWeek || slideDirection !== null}
+              disabled={currentWeek <= 1 && isLoadingWeek || slideDirection !== null}
             >
               <ChevronLeft className="w-4 h-4" />

[Survived] EqualityOperator
src/pages/Dashboard/Dashboard.jsx:753:25
                 '--ripple-button-ripple-color': currentWeek > 1 ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'
               }}
               onClick={() => navigateToWeek('prev')}
-              disabled={currentWeek <= 1 || isLoadingWeek || slideDirection !== null}
+              disabled={currentWeek > 1 || isLoadingWeek || slideDirection !== null}
             >
               <ChevronLeft className="w-4 h-4" />

[Survived] ObjectLiteral
src/pages/Dashboard/Dashboard.jsx:762:22
               variant="outline"
               size="icon"
-              style={{ 
-                backgroundColor: 'var(--color-background)',
-                borderColor: (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)', 
-                color: (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)',
-                '--ripple-button-ripple-color': (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'
-              }}
+              style={{}}
               onClick={() => navigateToWeek('next')}
               disabled={!currentDay?.week || currentWeek >= currentDay.week || isLoadingWeek || slideDirection !== null}

[Survived] EqualityOperator
src/pages/Dashboard/Dashboard.jsx:764:51
               style={{ 
                 backgroundColor: 'var(--color-background)',
-                borderColor: (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)', 
+                borderColor: (currentDay?.week && currentWeek >= currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)', 
                 color: (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)',
                 '--ripple-button-ripple-color': (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:765:25
               style={{ 
                 backgroundColor: 'var(--color-background)',
                 borderColor: (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)', 
-                color: (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)',
+                color: (false) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)',
                 '--ripple-button-ripple-color': (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'
               }}

[Survived] LogicalOperator
src/pages/Dashboard/Dashboard.jsx:765:25
               style={{ 
                 backgroundColor: 'var(--color-background)',
                 borderColor: (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)', 
-                color: (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)',
+                color: (currentDay?.week || currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)',
                 '--ripple-button-ripple-color': (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'
               }}

[Survived] OptionalChaining
src/pages/Dashboard/Dashboard.jsx:766:50
                 backgroundColor: 'var(--color-background)',
                 borderColor: (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)', 
                 color: (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)',
-                '--ripple-button-ripple-color': (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'
+                '--ripple-button-ripple-color': (currentDay.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'
               }}
               onClick={() => navigateToWeek('next')}

[Survived] OptionalChaining
src/pages/Dashboard/Dashboard.jsx:769:26
                 '--ripple-button-ripple-color': (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'
               }}
               onClick={() => navigateToWeek('next')}
-              disabled={!currentDay?.week || currentWeek >= currentDay.week || isLoadingWeek || slideDirection !== null}
+              disabled={!currentDay.week || currentWeek >= currentDay.week || isLoadingWeek || slideDirection !== null}
             >
               <ChevronRight className="w-4 h-4" />

[Survived] BooleanLiteral
src/pages/Dashboard/Dashboard.jsx:769:25
                 '--ripple-button-ripple-color': (currentDay?.week && currentWeek < currentDay.week) ? 'var(--color-pursuit-purple)' : 'var(--color-divider)'
               }}
               onClick={() => navigateToWeek('next')}
-              disabled={!currentDay?.week || currentWeek >= currentDay.week || isLoadingWeek || slideDirection !== null}
+              disabled={currentDay?.week || currentWeek >= currentDay.week || isLoadingWeek || slideDirection !== null}
             >
               <ChevronRight className="w-4 h-4" />

[NoCoverage] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:781:19
               const dayIsToday = isDateToday(day.day_date);
               const dayIsPast = isDatePast(day.day_date);
               
-              if (dayIsToday) {
+              if (false) {
                 // Today Card - expanded
                 return (

[NoCoverage] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:781:19
               const dayIsToday = isDateToday(day.day_date);
               const dayIsPast = isDatePast(day.day_date);
               
-              if (dayIsToday) {
+              if (true) {
                 // Today Card - expanded
                 return (

[NoCoverage] BlockStatement
src/pages/Dashboard/Dashboard.jsx:786:31
                 return (
                   <div key={day.id} className="dashboard__mobile-today-card">
                     <div className="dashboard__mobile-today-header">
-                      {(() => {
-                        const formattedDate = formatDayDate(day.day_date, true);
-                        return (
-                          <>
-                            {formattedDate.prefix && <strong>{formattedDate.prefix}</strong>}
-                            {formattedDate.date}
-                          </>
-                        );
-                      })()}
+                      {(() => {})()}
                     </div>
                     <div className="dashboard__mobile-today-separator" />

[NoCoverage] BooleanLiteral
src/pages/Dashboard/Dashboard.jsx:787:75
                   <div key={day.id} className="dashboard__mobile-today-card">
                     <div className="dashboard__mobile-today-header">
                       {(() => {
-                        const formattedDate = formatDayDate(day.day_date, true);
+                        const formattedDate = formatDayDate(day.day_date, false);
                         return (
                           <>

[NoCoverage] EqualityOperator
src/pages/Dashboard/Dashboard.jsx:797:35
                       })()}
                     </div>
                     <div className="dashboard__mobile-today-separator" />
-                    {day.tasks && day.tasks.length > 0 && (
+                    {day.tasks && day.tasks.length >= 0 && (
                       <div className="dashboard__mobile-today-section">
                         <h4 className="dashboard__mobile-today-section-title">Activities</h4>

[NoCoverage] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:797:22
                       })()}
                     </div>
                     <div className="dashboard__mobile-today-separator" />
-                    {day.tasks && day.tasks.length > 0 && (
-                      <div className="dashboard__mobile-today-section">
-                        <h4 className="dashboard__mobile-today-section-title">Activities</h4>
-                        <div className="dashboard__mobile-today-activities">
-                          {day.tasks.map((task, taskIndex) => (
-                            <div key={task.id}>
-                              <div className="dashboard__mobile-today-activity">{task.task_title}</div>
-                              {taskIndex < day.tasks.length - 1 && (
-                                <div className="dashboard__mobile-activity-divider" />
-                              )}
-                            </div>
-                          ))}
-                        </div>
-                      </div>
-                    )}
+                    {true}
           <button 
                       className="dashboard__mobile-go-btn"

[NoCoverage] ArrowFunction
src/pages/Dashboard/Dashboard.jsx:801:42
                       <div className="dashboard__mobile-today-section">
                         <h4 className="dashboard__mobile-today-section-title">Activities</h4>
                         <div className="dashboard__mobile-today-activities">
-                          {day.tasks.map((task, taskIndex) => (
-                            <div key={task.id}>
-                              <div className="dashboard__mobile-today-activity">{task.task_title}</div>
-                              {taskIndex < day.tasks.length - 1 && (
-                                <div className="dashboard__mobile-activity-divider" />
-                              )}
-                            </div>
-                          ))}
+                          {day.tasks.map(() => undefined)}
                         </div>
                       </div>

[NoCoverage] ArithmeticOperator
src/pages/Dashboard/Dashboard.jsx:804:44
                           {day.tasks.map((task, taskIndex) => (
                             <div key={task.id}>
                               <div className="dashboard__mobile-today-activity">{task.task_title}</div>
-                              {taskIndex < day.tasks.length - 1 && (
+                              {taskIndex < day.tasks.length + 1 && (
                                 <div className="dashboard__mobile-activity-divider" />
                               )}

[NoCoverage] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:804:32
                           {day.tasks.map((task, taskIndex) => (
                             <div key={task.id}>
                               <div className="dashboard__mobile-today-activity">{task.task_title}</div>
-                              {taskIndex < day.tasks.length - 1 && (
-                                <div className="dashboard__mobile-activity-divider" />
-                              )}
+                              {false}
                             </div>
                           ))}

[NoCoverage] BlockStatement
src/pages/Dashboard/Dashboard.jsx:820:22
           </button>
                   </div>
                 );
-              } else {
-                // Regular day card - condensed
-                return (
-                  <div key={day.id} className="dashboard__mobile-day">
-                    <div className="dashboard__mobile-day-header">
-                      {formatDayDate(day.day_date, false).full}
-                    </div>
-                    {dayIsPast && (
-                      <div className={`dashboard__mobile-checkbox ${day.completed ? 'dashboard__mobile-checkbox--checked' : ''}`} />
-                    )}
-                  </div>
-                );
-              }
+              } else {}
             })}
           </div>

[NoCoverage] BooleanLiteral
src/pages/Dashboard/Dashboard.jsx:825:52
                 return (
                   <div key={day.id} className="dashboard__mobile-day">
                     <div className="dashboard__mobile-day-header">
-                      {formatDayDate(day.day_date, false).full}
+                      {formatDayDate(day.day_date, true).full}
                     </div>
                     {dayIsPast && (

[NoCoverage] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:827:22
                     <div className="dashboard__mobile-day-header">
                       {formatDayDate(day.day_date, false).full}
                     </div>
-                    {dayIsPast && (
-                      <div className={`dashboard__mobile-checkbox ${day.completed ? 'dashboard__mobile-checkbox--checked' : ''}`} />
-                    )}
+                    {true}
                   </div>
                 );

[NoCoverage] LogicalOperator
src/pages/Dashboard/Dashboard.jsx:827:22
                     <div className="dashboard__mobile-day-header">
                       {formatDayDate(day.day_date, false).full}
                     </div>
-                    {dayIsPast && (
-                      <div className={`dashboard__mobile-checkbox ${day.completed ? 'dashboard__mobile-checkbox--checked' : ''}`} />
-                    )}
+                    {dayIsPast || <div className={`dashboard__mobile-checkbox ${day.completed ? 'dashboard__mobile-checkbox--checked' : ''}`} />}
                   </div>
                 );

[Survived] ArrowFunction
src/pages/Dashboard/Dashboard.jsx:843:35
           <div className="dashboard__mobile-upcoming">
             <h2 className="dashboard__mobile-section-title">Upcoming</h2>
             <div className="dashboard__mobile-upcoming-list">
-              {upcomingEvents.map((event, index) => (
-                <div key={index} className="dashboard__mobile-upcoming-item">
-                  <div className="dashboard__mobile-upcoming-content">
-                    <span className="dashboard__mobile-upcoming-date">{event.date}</span>
-                    <div className="dashboard__mobile-upcoming-details">
-                      <p className="dashboard__mobile-upcoming-title">{event.title}</p>
-                      <p className="dashboard__mobile-upcoming-time">{event.time}</p>
-                      {event.location && <p className="dashboard__mobile-upcoming-location">{event.location}</p>}
-                    </div>
-                  </div>
-                  <button className="dashboard__mobile-signup-btn">Sign up</button>
-                </div>
-              ))}
+              {upcomingEvents.map(() => undefined)}
             </div>
           </div>

[Survived] LogicalOperator
src/pages/Dashboard/Dashboard.jsx:850:24
                     <div className="dashboard__mobile-upcoming-details">
                       <p className="dashboard__mobile-upcoming-title">{event.title}</p>
                       <p className="dashboard__mobile-upcoming-time">{event.time}</p>
-                      {event.location && <p className="dashboard__mobile-upcoming-location">{event.location}</p>}
+                      {event.location || <p className="dashboard__mobile-upcoming-location">{event.location}</p>}
                     </div>
                   </div>

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:850:24
                     <div className="dashboard__mobile-upcoming-details">
                       <p className="dashboard__mobile-upcoming-title">{event.title}</p>
                       <p className="dashboard__mobile-upcoming-time">{event.time}</p>
-                      {event.location && <p className="dashboard__mobile-upcoming-location">{event.location}</p>}
+                      {false}
                     </div>
                   </div>

[Survived] LogicalOperator
src/pages/Dashboard/Dashboard.jsx:873:8
 
   return (
     <>
-      {error && (
-        <div className="p-4 mx-6 mt-6 bg-destructive/10 border border-destructive/20 rounded-lg">
-          <p className="text-destructive text-sm">{error}</p>
-          </div>
-        )}
+      {error || <div className="p-4 mx-6 mt-6 bg-destructive/10 border border-destructive/20 rounded-lg">
+          <p className="text-destructive text-sm">{error}</p>
+          </div>}
       
       {/* Conditionally render based on user status and role */}

[Survived] ConditionalExpression
src/pages/Dashboard/Dashboard.jsx:873:8
 
   return (
     <>
-      {error && (
-        <div className="p-4 mx-6 mt-6 bg-destructive/10 border border-destructive/20 rounded-lg">
-          <p className="text-destructive text-sm">{error}</p>
-          </div>
-        )}
+      {true}
       
       {/* Conditionally render based on user status and role */}

[Killed] BooleanLiteral
src/pages/Dashboard/Dashboard.jsx:880:8
         )}
       
       {/* Conditionally render based on user status and role */}
-      {!isActive ? renderHistoricalView() : 
+      {isActive ? renderHistoricalView() : 
        isVolunteer ? renderVolunteerView() : 
        renderDashboardContent()}
killedBy: Dashboard - Role-Based Access Control Student/Builder Role should render dashboard content for active students
statusReason: Unable to find an element with the text: /Hey John. Good to see you!/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex items-center justify-center min-h-screen p-8"
    >
